iSYSTEMLabs/winIDEAExampleWorkspaces/TI/TMS570LS1227/emptyTargetInit/TMS570LS1227_sfr.h
};

#define CRS_0 (*(volatile struct CRS_0_tag *) 0x40006c00)

struct Firewall_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t ADD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIREWALL_CSSA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t LENG:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIREWALL_CSL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t ADD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIREWALL_NVDSSA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t LENG:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIREWALL_NVDSL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:6;
      uint64_t ADD:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIREWALL_VDSSA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:6;
      uint64_t LENG:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIREWALL_VDSL;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FPA:1;
      uint64_t VDS:1;
      uint64_t VDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIREWALL_CR;

};

#define Firewall_0 (*(volatile struct Firewall_0_tag *) 0x40011c00)

struct RCC_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSI16ON:1;
      uint64_t HSI16KERON:1;
      uint64_t HSI16RDYF:1;
      uint64_t HSI16DIVEN:1;
      uint64_t HSI16DIVF:1;
      uint64_t reservedSpace0:3;
      uint64_t MSION:1;
      uint64_t MSIRDY:1;
      uint64_t reservedSpace1:6;
      uint64_t HSEON:1;
      uint64_t HSERDY:1;
      uint64_t HSEBYP:1;
      uint64_t CSSLSEON:1;
      uint64_t RTCPRE:2;
      uint64_t reservedSpace2:2;
      uint64_t PLLON:1;
      uint64_t PLLRDY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSI16CAL:8;
      uint64_t HSI16TRIM:5;
      uint64_t MSIRANGE:3;
      uint64_t MSICAL:8;
      uint64_t MSITRIM:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICSCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSI48ON:1;
      uint64_t HSI48RDY:1;
      uint64_t reservedSpace0:6;
      uint64_t HSI48CAL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRRCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SW:2;
      uint64_t SWS:2;
      uint64_t HPRE:4;
      uint64_t PPRE1:3;
      uint64_t PPRE2:3;
      uint64_t reservedSpace0:1;
      uint64_t STOPWUCK:1;
      uint64_t PLLSRC:1;
      uint64_t reservedSpace1:1;
      uint64_t PLLMUL:4;
      uint64_t PLLDIV:2;
      uint64_t MCOSEL:3;
      uint64_t reservedSpace2:1;
      uint64_t MCOPRE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LSIRDYIE:1;
      uint64_t LSERDYIE:1;
      uint64_t HSI16RDYIE:1;
      uint64_t HSERDYIE:1;
      uint64_t PLLRDYIE:1;
      uint64_t MSIRDYIE:1;
      uint64_t HSI48RDYIE:1;
      uint64_t CSSLSE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LSIRDYF:1;
      uint64_t LSERDYF:1;
      uint64_t HSI16RDYF:1;
      uint64_t HSERDYF:1;
      uint64_t PLLRDYF:1;
      uint64_t MSIRDYF:1;
      uint64_t HSI48RDYF:1;
      uint64_t CSSLSEF:1;
      uint64_t CSSHSEF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LSIRDYC:1;
      uint64_t LSERDYC:1;
      uint64_t HSI16RDYC:1;
      uint64_t HSERDYC:1;
      uint64_t PLLRDYC:1;
      uint64_t MSIRDYC:1;
      uint64_t HSI48RDYC:1;
      uint64_t CSSLSEC:1;
      uint64_t CSSHSEC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CICR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IOPARST:1;
      uint64_t IOPBRST:1;
      uint64_t IOPCRST:1;
      uint64_t IOPDRST:1;
      uint64_t reservedSpace0:3;
      uint64_t IOPHRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOPRSTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMARST:1;
      uint64_t reservedSpace0:7;
      uint64_t MIFRST:1;
      uint64_t reservedSpace1:3;
      uint64_t CRCRST:1;
      uint64_t reservedSpace2:3;
      uint64_t TOUCHRST:1;
      uint64_t reservedSpace3:3;
      uint64_t RNGRST:1;
      uint64_t reservedSpace4:3;
      uint64_t CRYPRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHBRSTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCFGRST:1;
      uint64_t reservedSpace0:1;
      uint64_t TIM21RST:1;
      uint64_t reservedSpace1:2;
      uint64_t TM12RST:1;
      uint64_t reservedSpace2:3;
      uint64_t ADCRST:1;
      uint64_t reservedSpace3:2;
      uint64_t SPI1RST:1;
      uint64_t reservedSpace4:1;
      uint64_t USART1RST:1;
      uint64_t reservedSpace5:7;
      uint64_t DBGRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB2RSTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM2RST:1;
      uint64_t reservedSpace0:3;
      uint64_t TIM6RST:1;
      uint64_t reservedSpace1:4;
      uint64_t LCDRST:1;
      uint64_t reservedSpace2:1;
      uint64_t WWDRST:1;
      uint64_t reservedSpace3:2;
      uint64_t SPI2RST:1;
      uint64_t reservedSpace4:2;
      uint64_t LPUART12RST:1;
      uint64_t LPUART1RST:1;
      uint64_t reservedSpace5:2;
      uint64_t I2C1RST:1;
      uint64_t I2C2RST:1;
      uint64_t USBRST:1;
      uint64_t reservedSpace6:3;
      uint64_t CRSRST:1;
      uint64_t PWRRST:1;
      uint64_t DACRST:1;
      uint64_t reservedSpace7:1;
      uint64_t LPTIM1RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB1RSTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IOPAEN:1;
      uint64_t IOPBEN:1;
      uint64_t IOPCEN:1;
      uint64_t IOPDEN:1;
      uint64_t reservedSpace0:3;
      uint64_t IOPHEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOPENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAEN:1;
      uint64_t reservedSpace0:7;
      uint64_t MIFEN:1;
      uint64_t reservedSpace1:3;
      uint64_t CRCEN:1;
      uint64_t reservedSpace2:3;
      uint64_t TOUCHEN:1;
      uint64_t reservedSpace3:3;
      uint64_t RNGEN:1;
      uint64_t reservedSpace4:3;
      uint64_t CRYPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHBENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCFGEN:1;
      uint64_t reservedSpace0:1;
      uint64_t TIM21EN:1;
      uint64_t reservedSpace1:2;
      uint64_t TIM22EN:1;
      uint64_t reservedSpace2:1;
      uint64_t MIFIEN:1;
      uint64_t reservedSpace3:1;
      uint64_t ADCEN:1;
      uint64_t reservedSpace4:2;
      uint64_t SPI1EN:1;
      uint64_t reservedSpace5:1;
      uint64_t USART1EN:1;
      uint64_t reservedSpace6:7;
      uint64_t DBGEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB2ENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM2EN:1;
      uint64_t reservedSpace0:3;
      uint64_t TIM6EN:1;
      uint64_t reservedSpace1:4;
      uint64_t LCDEN:1;
      uint64_t reservedSpace2:1;
      uint64_t WWDGEN:1;
      uint64_t reservedSpace3:2;
      uint64_t SPI2EN:1;
      uint64_t reservedSpace4:2;
      uint64_t USART2EN:1;
      uint64_t LPUART1EN:1;
      uint64_t reservedSpace5:2;
      uint64_t I2C1EN:1;
      uint64_t I2C2EN:1;
      uint64_t USBEN:1;
      uint64_t reservedSpace6:3;
      uint64_t CRSEN:1;
      uint64_t PWREN:1;
      uint64_t DACEN:1;
      uint64_t reservedSpace7:1;
      uint64_t LPTIM1EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB1ENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IOPASMEN:1;
      uint64_t IOPBSMEN:1;
      uint64_t IOPCSMEN:1;
      uint64_t IOPDSMEN:1;
      uint64_t reservedSpace0:3;
      uint64_t IOPHSMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOPSMEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMASMEN:1;
      uint64_t reservedSpace0:7;
      uint64_t MIFSMEN:1;
      uint64_t SRAMSMEN:1;
      uint64_t reservedSpace1:2;
      uint64_t CRCSMEN:1;
      uint64_t reservedSpace2:3;
      uint64_t TOUCHSMEN:1;
      uint64_t reservedSpace3:3;
      uint64_t RNGSMEN:1;
      uint64_t reservedSpace4:3;
      uint64_t CRYPSMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHBSMENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCFGSMEN:1;
      uint64_t reservedSpace0:1;
      uint64_t TIM21SMEN:1;
      uint64_t reservedSpace1:2;
      uint64_t TIM22SMEN:1;
      uint64_t reservedSpace2:3;
      uint64_t ADCSMEN:1;
      uint64_t reservedSpace3:2;
      uint64_t SPI1SMEN:1;
      uint64_t reservedSpace4:1;
      uint64_t USART1SMEN:1;
      uint64_t reservedSpace5:7;
      uint64_t DBGSMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB2SMENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM2SMEN:1;
      uint64_t reservedSpace0:3;
      uint64_t TIM6SMEN:1;
      uint64_t reservedSpace1:4;
      uint64_t LCDSMEN:1;
      uint64_t reservedSpace2:1;
      uint64_t WWDGSMEN:1;
      uint64_t reservedSpace3:2;
      uint64_t SPI2SMEN:1;
      uint64_t reservedSpace4:2;
      uint64_t USART2SMEN:1;
      uint64_t LPUART1SMEN:1;
      uint64_t reservedSpace5:2;
      uint64_t I2C1SMEN:1;
      uint64_t I2C2SMEN:1;
      uint64_t USBSMEN:1;
      uint64_t reservedSpace6:3;
      uint64_t CRSSMEN:1;
      uint64_t PWRSMEN:1;
      uint64_t DACSMEN:1;
      uint64_t reservedSpace7:1;
      uint64_t LPTIM1SMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB1SMENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USART1SEL0:1;
      uint64_t USART1SEL1:1;
      uint64_t USART2SEL0:1;
      uint64_t USART2SEL1:1;
      uint64_t reservedSpace0:6;
      uint64_t LPUART1SEL0:1;
      uint64_t LPUART1SEL1:1;
      uint64_t I2C1SEL0:1;
      uint64_t I2C1SEL1:1;
      uint64_t reservedSpace1:4;
      uint64_t LPTIM1SEL0:1;
      uint64_t LPTIM1SEL1:1;
      uint64_t reservedSpace2:6;
      uint64_t HSI48MSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCIPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LSION:1;
      uint64_t LSIRDY:1;
      uint64_t reservedSpace0:6;
      uint64_t LSEON:1;
      uint64_t LSERDY:1;
      uint64_t LSEBYP:1;
      uint64_t LSEDRV:2;
      uint64_t CSSLSEON:1;
      uint64_t CSSLSED:1;
      uint64_t reservedSpace1:1;
      uint64_t RTCSEL:2;
      uint64_t RTCEN:1;
      uint64_t RTCRST:1;
      uint64_t reservedSpace2:4;
      uint64_t RMVF:1;
      uint64_t OBLRSTF:1;
      uint64_t PINRSTF:1;
      uint64_t PORRSTF:1;
      uint64_t SFTRSTF:1;
      uint64_t IWDGRSTF:1;
      uint64_t WWDGRSTF:1;
      uint64_t LPWRSTF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR;

