iSYSTEMLabs/winIDEAExampleWorkspaces/TI/TMS570LS1227/emptyTargetInit/TMS570LS1227_sfr.h
};

#define I2C2_1 (*(volatile struct I2C2_1_tag *) 0x40005800)

struct PWR_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPDS:1;
      uint64_t PDDS:1;
      uint64_t CWUF:1;
      uint64_t CSBF:1;
      uint64_t PVDE:1;
      uint64_t PLS:3;
      uint64_t DBP:1;
      uint64_t FPDS:1;
      uint64_t FWU:1;
      uint64_t VOS:2;
      uint64_t DS_EE_KOFF:1;
      uint64_t LPRUN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WUF:1;
      uint64_t SBF:1;
      uint64_t PVDO:1;
      uint64_t BRR:1;
      uint64_t VOSF:1;
      uint64_t REGLPF:1;
      uint64_t reservedSpace0:2;
      uint64_t EWUP:1;
      uint64_t BRE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR;

};

#define PWR_1 (*(volatile struct PWR_1_tag *) 0x40007000)

struct Flash_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LATENCY:1;
      uint64_t PRFTEN:1;
      uint64_t reservedSpace0:1;
      uint64_t SLEEP_PD:1;
      uint64_t RUN_PD:1;
      uint64_t DESAB_BUF:1;
      uint64_t PRE_READ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ACR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PELOCK:1;
      uint64_t PRGLOCK:1;
      uint64_t OPTLOCK:1;
      uint64_t PROG:1;
      uint64_t DATA:1;
      uint64_t reservedSpace0:3;
      uint64_t FTDW:1;
      uint64_t ERASE:1;
      uint64_t FPRG:1;
      uint64_t reservedSpace1:4;
      uint64_t PARALLELBANK:1;
      uint64_t EOPIE:1;
      uint64_t ERRIE:1;
      uint64_t OBL_LAUNCH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PECR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDKEYR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDKEYR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PEKEYR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEKEYR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRGKEYR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRGKEYR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPTKEYR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPTKEYR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BSY:1;
      uint64_t EOP:1;
      uint64_t ENDHV:1;
      uint64_t READY:1;
      uint64_t reservedSpace0:4;
      uint64_t WRPERR:1;
      uint64_t PGAERR:1;
      uint64_t SIZERR:1;
      uint64_t OPTVERR:1;
      uint64_t reservedSpace1:2;
      uint64_t RDERR:1;
      uint64_t reservedSpace2:1;
      uint64_t NOTZEROERR:1;
      uint64_t FWWERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDPRT:8;
      uint64_t SPRMOD:1;
      uint64_t reservedSpace0:7;
      uint64_t BOR_LEV:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OBR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WRPR;

};

#define Flash_1 (*(volatile struct Flash_1_tag *) 0x40022000)

struct EXTI_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MR0:1;
      uint64_t MR1:1;
      uint64_t MR2:1;
      uint64_t MR3:1;
      uint64_t MR4:1;
      uint64_t MR5:1;
      uint64_t MR6:1;
      uint64_t MR7:1;
      uint64_t MR8:1;
      uint64_t MR9:1;
      uint64_t MR10:1;
      uint64_t MR11:1;
      uint64_t MR12:1;
      uint64_t MR13:1;
      uint64_t MR14:1;
      uint64_t MR15:1;
      uint64_t MR16:1;
      uint64_t MR17:1;
      uint64_t reservedSpace0:1;
      uint64_t MR19:1;
      uint64_t reservedSpace1:1;
      uint64_t MR21:1;
      uint64_t MR22:1;
      uint64_t MR23:1;
      uint64_t reservedSpace2:1;
      uint64_t MR25:1;
      uint64_t reservedSpace3:1;
      uint64_t MR27:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MR0:1;
      uint64_t MR1:1;
      uint64_t MR2:1;
      uint64_t MR3:1;
      uint64_t MR4:1;
      uint64_t MR5:1;
      uint64_t MR6:1;
      uint64_t MR7:1;
      uint64_t MR8:1;
      uint64_t MR9:1;
      uint64_t MR10:1;
      uint64_t MR11:1;
      uint64_t MR12:1;
      uint64_t MR13:1;
      uint64_t MR14:1;
      uint64_t MR15:1;
      uint64_t MR16:1;
      uint64_t MR17:1;
      uint64_t reservedSpace0:1;
      uint64_t MR19:1;
      uint64_t reservedSpace1:1;
      uint64_t MR21:1;
      uint64_t MR22:1;
      uint64_t MR23:1;
      uint64_t reservedSpace2:1;
      uint64_t MR25:1;
      uint64_t reservedSpace3:1;
      uint64_t MR27:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TR0:1;
      uint64_t TR1:1;
      uint64_t TR2:1;
      uint64_t TR3:1;
      uint64_t TR4:1;
      uint64_t TR5:1;
      uint64_t TR6:1;
      uint64_t TR7:1;
      uint64_t TR8:1;
      uint64_t TR9:1;
      uint64_t TR10:1;
      uint64_t TR11:1;
      uint64_t TR12:1;
      uint64_t TR13:1;
      uint64_t TR14:1;
      uint64_t TR15:1;
      uint64_t TR16:1;
      uint64_t TR17:1;
      uint64_t reservedSpace0:1;
      uint64_t TR19:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TR0:1;
      uint64_t TR1:1;
      uint64_t TR2:1;
      uint64_t TR3:1;
      uint64_t TR4:1;
      uint64_t TR5:1;
      uint64_t TR6:1;
      uint64_t TR7:1;
      uint64_t TR8:1;
      uint64_t TR9:1;
      uint64_t TR10:1;
      uint64_t TR11:1;
      uint64_t TR12:1;
      uint64_t TR13:1;
      uint64_t TR14:1;
      uint64_t TR15:1;
      uint64_t TR16:1;
      uint64_t TR17:1;
      uint64_t reservedSpace0:1;
      uint64_t TR19:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWIER0:1;
      uint64_t SWIER1:1;
      uint64_t SWIER2:1;
      uint64_t SWIER3:1;
      uint64_t SWIER4:1;
      uint64_t SWIER5:1;
      uint64_t SWIER6:1;
      uint64_t SWIER7:1;
      uint64_t SWIER8:1;
      uint64_t SWIER9:1;
      uint64_t SWIER10:1;
      uint64_t SWIER11:1;
      uint64_t SWIER12:1;
      uint64_t SWIER13:1;
      uint64_t SWIER14:1;
      uint64_t SWIER15:1;
      uint64_t SWIER16:1;
      uint64_t SWIER17:1;
      uint64_t reservedSpace0:1;
      uint64_t SWIER19:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SWIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PR0:1;
      uint64_t PR1:1;
      uint64_t PR2:1;
      uint64_t PR3:1;
      uint64_t PR4:1;
      uint64_t PR5:1;
      uint64_t PR6:1;
      uint64_t PR7:1;
      uint64_t PR8:1;
      uint64_t PR9:1;
      uint64_t PR10:1;
      uint64_t PR11:1;
      uint64_t PR12:1;
      uint64_t PR13:1;
      uint64_t PR14:1;
      uint64_t PR15:1;
      uint64_t PR16:1;
      uint64_t PR17:1;
      uint64_t reservedSpace0:1;
      uint64_t PR19:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PR;

