iSYSTEMLabs/winIDEAExampleWorkspaces/TI/TMS570LS1227/emptyTargetInit/TMS570LS1227_sfr.h
};

#define EXTI_1 (*(volatile struct EXTI_1_tag *) 0x40010400)

struct ADC_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADRDY:1;
      uint64_t EOSMP:1;
      uint64_t EOC:1;
      uint64_t EOS:1;
      uint64_t OVR:1;
      uint64_t reservedSpace0:2;
      uint64_t AWD:1;
      uint64_t reservedSpace1:3;
      uint64_t EOCAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADRDYIE:1;
      uint64_t EOSMPIE:1;
      uint64_t EOCIE:1;
      uint64_t EOSIE:1;
      uint64_t OVRIE:1;
      uint64_t reservedSpace0:2;
      uint64_t AWDIE:1;
      uint64_t reservedSpace1:3;
      uint64_t EOCALIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADEN:1;
      uint64_t ADDIS:1;
      uint64_t ADSTART:1;
      uint64_t reservedSpace0:1;
      uint64_t ADSTP:1;
      uint64_t reservedSpace1:23;
      uint64_t ADVREGEN:1;
      uint64_t reservedSpace2:2;
      uint64_t ADCAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAEN:1;
      uint64_t DMACFG:1;
      uint64_t SCANDIR:1;
      uint64_t RES:2;
      uint64_t ALIGN:1;
      uint64_t EXTSEL:3;
      uint64_t reservedSpace0:1;
      uint64_t EXTEN:2;
      uint64_t OVRMOD:1;
      uint64_t CONT:1;
      uint64_t AUTDLY:1;
      uint64_t AUTOFF:1;
      uint64_t DISCEN:1;
      uint64_t reservedSpace1:5;
      uint64_t AWDSGL:1;
      uint64_t AWDEN:1;
      uint64_t reservedSpace2:2;
      uint64_t AWDCH:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVSE:1;
      uint64_t reservedSpace0:1;
      uint64_t OVSR:3;
      uint64_t OVSS:4;
      uint64_t TOVS:1;
      uint64_t reservedSpace1:20;
      uint64_t CKMODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SMPR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPR;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LT:12;
      uint64_t reservedSpace0:4;
      uint64_t HT:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TR;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHSEL0:1;
      uint64_t CHSEL1:1;
      uint64_t CHSEL2:1;
      uint64_t CHSEL3:1;
      uint64_t CHSEL4:1;
      uint64_t CHSEL5:1;
      uint64_t CHSEL6:1;
      uint64_t CHSEL7:1;
      uint64_t CHSEL8:1;
      uint64_t CHSEL9:1;
      uint64_t CHSEL10:1;
      uint64_t CHSEL11:1;
      uint64_t CHSEL12:1;
      uint64_t CHSEL13:1;
      uint64_t CHSEL14:1;
      uint64_t CHSEL15:1;
      uint64_t CHSEL16:1;
      uint64_t CHSEL17:1;
      uint64_t CHSEL18:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSELR;

  uint8_t res2[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR;

  uint8_t res3[112];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CALFACT:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CALFACT;

  uint8_t res4[592];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:18;
      uint64_t PRESC:4;
      uint64_t VREFEN:1;
      uint64_t TSEN:1;
      uint64_t VLCDEN:1;
      uint64_t LFMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR;

};

#define ADC_1 (*(volatile struct ADC_1_tag *) 0x40012400)

struct DBGMCU_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEV_ID:12;
      uint64_t reservedSpace0:4;
      uint64_t REV_ID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDCODE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DBG_SLEEP:1;
      uint64_t DBG_STOP:1;
      uint64_t DBG_STANDBY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DBG_TIMER2_STOP:1;
      uint64_t reservedSpace0:3;
      uint64_t DBG_TIMER6_STOP:1;
      uint64_t reservedSpace1:5;
      uint64_t DBG_RTC_STOP:1;
      uint64_t DBG_WWDG_STOP:1;
      uint64_t DBG_IWDG_STOP:1;
      uint64_t reservedSpace2:8;
      uint64_t DBG_I2C1_STOP:1;
      uint64_t DBG_I2C2_STOP:1;
      uint64_t reservedSpace3:8;
      uint64_t DBG_LPTIMER_STOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB1_FZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t DBG_TIMER21_STOP:1;
      uint64_t reservedSpace1:3;
      uint64_t DBG_TIMER22_STO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB2_FZ;

};

#define DBGMCU_1 (*(volatile struct DBGMCU_1_tag *) 0x40015800)

struct TIM6_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
      uint64_t UDIS:1;
      uint64_t URS:1;
      uint64_t OPM:1;
      uint64_t reservedSpace0:3;
      uint64_t ARPE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t MMS:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR2;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UIE:1;
      uint64_t reservedSpace0:7;
      uint64_t UDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EGR;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARR;

