iSYSTEMLabs/winIDEAExampleWorkspaces/TI/TMS570LS1227/emptyTargetInit/TMS570LS1227_sfr.h
};

#define NVIC_1 (*(volatile struct NVIC_1_tag *) 0xe000e100)

struct Floating_point_registers_Advanced_SIMD_and_Floating_point_Extension_system_registers_tag
{
  uint32_t FPSID;
  uint8_t res0[4092];

  uint32_t FPSCR;
  uint8_t res1[20476];

  uint32_t MVFR1;
  uint8_t res2[4092];

  uint32_t MVFR0;
  uint8_t res3[4092];

  uint32_t FPEXC;
};

#define Floating_point_registers_Advanced_SIMD_and_Floating_point_Extension_system_registers (*(volatile struct Floating_point_registers_Advanced_SIMD_and_Floating_point_Extension_system_registers_tag *) 0xa0000)

struct TCRAMW_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECC_0:4;
      uint64_t reservedSpace0:4;
      uint64_t ECC_1:1;
      uint64_t reservedSpace1:7;
      uint64_t ADDR_0:4;
      uint64_t reservedSpace2:4;
      uint64_t ADDR_1:4;
      uint64_t reservedSpace3:2;
      uint64_t EMU:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAMCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRESHOLD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAMTHRESHOLD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SINGLE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAMOCCUR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAMINTCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SERR:1;
      uint64_t reservedSpace0:1;
      uint64_t ADDR_0:1;
      uint64_t reservedSpace1:1;
      uint64_t ADDR_1:1;
      uint64_t DERR:1;
      uint64_t reservedSpace2:2;
      uint64_t RADDR:1;
      uint64_t WADDR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAMERRSTATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t SINGLE:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAMSERRADDR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t UNCORRECTABLE:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAMUERRADDR;

  uint8_t res1[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEST_0:4;
      uint64_t reservedSpace0:2;
      uint64_t TEST_1:2;
      uint64_t TRIGGER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAMTEST;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAM:16;
      uint64_t reservedSpace0:10;
      uint64_t ECC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAMADDRDECVECT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t ADDRESS:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAMPERRADDR;

};

#define TCRAMW (*(volatile struct TCRAMW_tag *) 0xfffff800)

struct SYS_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECPCLKFUN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSPC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECPCLKDIR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSPC2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECPCLKDIN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSPC3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECPCLKDOUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSPC4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECPCLKSET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSPC5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECPCLKCLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSPC6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECPCLKODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSPC7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECPCLKPUE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSPC8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECPCLKPS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSPC9;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLKSR_1_0OFF:2;
      uint64_t reservedSpace0:1;
      uint64_t CLKSR_7_3OFF:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSDIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETCLKSR_1_0OFF:2;
      uint64_t reservedSpace0:1;
      uint64_t SETCLKSR_7_3OFF:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSDISSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRCLKSR_1_0OFF:2;
      uint64_t reservedSpace0:1;
      uint64_t CLRCLKSR_7_3OFF:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSDISCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GCLKOFF:1;
      uint64_t HCLKOFF:1;
      uint64_t VCLKPOFF:1;
      uint64_t VCLK2OFF:1;
      uint64_t VCLKA1OFF:1;
      uint64_t VCLKA2OFF:1;
      uint64_t reservedSpace0:2;
      uint64_t VCLK3OFF:1;
      uint64_t reservedSpace1:1;
      uint64_t VCLKA3OFF:1;
      uint64_t VCLKA4OFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDDIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETGCLKOFF:1;
      uint64_t SETHCLKOFF:1;
      uint64_t SETVCLKPOFF:1;
      uint64_t SETVCLK2OFF:1;
      uint64_t SETVCLKA1OFF:1;
      uint64_t SETVCLKA2OFF:1;
      uint64_t SETRTI1CLKOFF:1;
      uint64_t reservedSpace0:1;
      uint64_t SETVCLK3OFF:1;
      uint64_t reservedSpace1:1;
      uint64_t SETVCLKA3OFF:1;
      uint64_t SETVCLKA4OFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDDISSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRGCLKOFF:1;
      uint64_t CLRHCLKOFF:1;
      uint64_t CLRVCLKPOFF:1;
      uint64_t CLRVCLK2OFF:1;
      uint64_t CLRVCLKA1OFF:1;
      uint64_t CLRVCLKA2OFF:1;
      uint64_t CLRRTI1CLKOFF:1;
      uint64_t reservedSpace0:1;
      uint64_t CLRVCLK3OFF:1;
      uint64_t reservedSpace1:1;
      uint64_t CLRVCLKA3OFF:1;
      uint64_t CLRVCLKA4OFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CDDISCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GHVSRC:4;
      uint64_t reservedSpace0:12;
      uint64_t HVLPM:4;
      uint64_t reservedSpace1:4;
      uint64_t GHVWAKE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GHVSRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VCLKA1S:4;
      uint64_t reservedSpace0:4;
      uint64_t VCLKA2S:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VCLKASRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTI1SRC:4;
      uint64_t reservedSpace0:4;
      uint64_t RTI1DIV:2;
      uint64_t reservedSpace1:6;
      uint64_t RTI2SRC:4;
      uint64_t reservedSpace2:4;
      uint64_t RTI2DIV:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCLKSRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLKSR_1_0V:2;
      uint64_t reservedSpace0:1;
      uint64_t CLKSR_7_3V:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSVSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTGENA:4;
      uint64_t reservedSpace0:4;
      uint64_t ROM_DIV:2;
      uint64_t reservedSpace1:6;
      uint64_t MBIST_ALGSEL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSTGCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MINITGENA:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MINITGCR;

  uint32_t MSINENA;
  uint32_t MSTFAIL;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTDONE:1;
      uint64_t reservedSpace0:7;
      uint64_t MINIDONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSTCGSTAT;

  uint32_t MINISTAT;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLLMUL:16;
      uint64_t REFCLKDIV:6;
      uint64_t reservedSpace0:1;
      uint64_t ROF:1;
      uint64_t PLLDIV:5;
      uint64_t MASK_SLIP:2;
      uint64_t ROS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLCTL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPR_AMOUNT:9;
      uint64_t ODPLL:3;
      uint64_t MULMOD:9;
      uint64_t reservedSpace0:1;
      uint64_t SPREADINGRATE:9;
      uint64_t FMENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLCTL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECPCLK_SLEW:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSPC10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t X:8;
      uint64_t Y:8;
      uint64_t WAFER:6;
      uint64_t LOT:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEIDL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOT:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEIDH;

