iSYSTEMLabs/winIDEAExampleWorkspaces/TI/TMS570LS1227/emptyTargetInit/TMS570LS1227_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_73;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_74;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_75;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_76;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_77;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_78;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_79;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_80;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_81;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_82;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_83;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_84;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_85;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_86;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_87;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_88;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_89;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_90;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_91;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_92;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_93;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_94;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_95;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_96;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_97;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_98;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_99;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_100;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_101;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_102;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_103;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_104;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_105;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_106;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_107;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_108;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_109;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_110;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_111;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_112;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_113;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_114;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_115;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_116;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_117;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_118;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_119;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_120;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_121;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_122;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_123;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_124;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_125;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_126;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t CSNR:8;
      uint64_t DFSEL:2;
      uint64_t WDEL:1;
      uint64_t LOCK:1;
      uint64_t CSHOLD:1;
      uint64_t BUFMODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Transmit_Data_Register_127;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:16;
      uint64_t LCSNR:8;
      uint64_t DLEN_ERR:1;
      uint64_t TIMEOUT:1;
      uint64_t PARITYERR:1;
      uint64_t DESYNC:1;
      uint64_t BITERR:1;
      uint64_t TXFULL:1;
      uint64_t RXOVR:1;
      uint64_t RXEMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Receive_Buffer_Register_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:16;
      uint64_t LCSNR:8;
      uint64_t DLEN_ERR:1;
      uint64_t TIMEOUT:1;
      uint64_t PARITYERR:1;
      uint64_t DESYNC:1;
      uint64_t BITERR:1;
      uint64_t TXFULL:1;
      uint64_t RXOVR:1;
      uint64_t RXEMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Receive_Buffer_Register_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:16;
      uint64_t LCSNR:8;
      uint64_t DLEN_ERR:1;
      uint64_t TIMEOUT:1;
      uint64_t PARITYERR:1;
      uint64_t DESYNC:1;
      uint64_t BITERR:1;
      uint64_t TXFULL:1;
      uint64_t RXOVR:1;
      uint64_t RXEMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Receive_Buffer_Register_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:16;
      uint64_t LCSNR:8;
      uint64_t DLEN_ERR:1;
      uint64_t TIMEOUT:1;
      uint64_t PARITYERR:1;
      uint64_t DESYNC:1;
      uint64_t BITERR:1;
      uint64_t TXFULL:1;
      uint64_t RXOVR:1;
      uint64_t RXEMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Receive_Buffer_Register_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:16;
      uint64_t LCSNR:8;
      uint64_t DLEN_ERR:1;
      uint64_t TIMEOUT:1;
      uint64_t PARITYERR:1;
      uint64_t DESYNC:1;
      uint64_t BITERR:1;
      uint64_t TXFULL:1;
      uint64_t RXOVR:1;
      uint64_t RXEMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Receive_Buffer_Register_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:16;
      uint64_t LCSNR:8;
      uint64_t DLEN_ERR:1;
      uint64_t TIMEOUT:1;
      uint64_t PARITYERR:1;
      uint64_t DESYNC:1;
      uint64_t BITERR:1;
      uint64_t TXFULL:1;
      uint64_t RXOVR:1;
      uint64_t RXEMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Receive_Buffer_Register_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:16;
      uint64_t LCSNR:8;
      uint64_t DLEN_ERR:1;
      uint64_t TIMEOUT:1;
      uint64_t PARITYERR:1;
      uint64_t DESYNC:1;
      uint64_t BITERR:1;
      uint64_t TXFULL:1;
      uint64_t RXOVR:1;
      uint64_t RXEMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Receive_Buffer_Register_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:16;
      uint64_t LCSNR:8;
      uint64_t DLEN_ERR:1;
      uint64_t TIMEOUT:1;
      uint64_t PARITYERR:1;
      uint64_t DESYNC:1;
      uint64_t BITERR:1;
      uint64_t TXFULL:1;
      uint64_t RXOVR:1;
      uint64_t RXEMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Receive_Buffer_Register_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:16;
      uint64_t LCSNR:8;
      uint64_t DLEN_ERR:1;
      uint64_t TIMEOUT:1;
      uint64_t PARITYERR:1;
      uint64_t DESYNC:1;
      uint64_t BITERR:1;
      uint64_t TXFULL:1;
      uint64_t RXOVR:1;
      uint64_t RXEMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Receive_Buffer_Register_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:16;
      uint64_t LCSNR:8;
      uint64_t DLEN_ERR:1;
      uint64_t TIMEOUT:1;
      uint64_t PARITYERR:1;
      uint64_t DESYNC:1;
      uint64_t BITERR:1;
      uint64_t TXFULL:1;
      uint64_t RXOVR:1;
      uint64_t RXEMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Receive_Buffer_Register_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:16;
      uint64_t LCSNR:8;
      uint64_t DLEN_ERR:1;
      uint64_t TIMEOUT:1;
      uint64_t PARITYERR:1;
      uint64_t DESYNC:1;
      uint64_t BITERR:1;
      uint64_t TXFULL:1;
      uint64_t RXOVR:1;
      uint64_t RXEMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Receive_Buffer_Register_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:16;
      uint64_t LCSNR:8;
      uint64_t DLEN_ERR:1;
      uint64_t TIMEOUT:1;
      uint64_t PARITYERR:1;
      uint64_t DESYNC:1;
      uint64_t BITERR:1;
      uint64_t TXFULL:1;
      uint64_t RXOVR:1;
      uint64_t RXEMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Receive_Buffer_Register_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:16;
      uint64_t LCSNR:8;
      uint64_t DLEN_ERR:1;
      uint64_t TIMEOUT:1;
      uint64_t PARITYERR:1;
      uint64_t DESYNC:1;
      uint64_t BITERR:1;
      uint64_t TXFULL:1;
      uint64_t RXOVR:1;
      uint64_t RXEMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Receive_Buffer_Register_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:16;
      uint64_t LCSNR:8;
      uint64_t DLEN_ERR:1;
      uint64_t TIMEOUT:1;
      uint64_t PARITYERR:1;
      uint64_t DESYNC:1;
      uint64_t BITERR:1;
      uint64_t TXFULL:1;
      uint64_t RXOVR:1;
      uint64_t RXEMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Multi_buffer_RAM_Receive_Buffer_Register_13;

