iSYSTEMLabs/winIDEAExampleWorkspaces/TI/TMS570LS1227/emptyTargetInit/TMS570LS1227_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LAST_CONV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADLASTCONV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t EV_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t EV_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADLASTCONV0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t EV_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t EV_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADLASTCONV1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t EV_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t EV_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADLASTCONV2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t EV_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t EV_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADLASTCONV3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t EV_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t EV_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADLASTCONV4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t EV_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t EV_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADLASTCONV5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t EV_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t EV_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADLASTCONV6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t EV_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t EV_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADLASTCONV7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G1_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t G1_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t G1_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG1BUFFER0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G1_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t G1_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t G1_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG1BUFFER1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G1_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t G1_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t G1_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG1BUFFER2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G1_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t G1_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t G1_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG1BUFFER3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G1_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t G1_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t G1_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG1BUFFER4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G1_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t G1_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t G1_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG1BUFFER5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G1_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t G1_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t G1_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG1BUFFER6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G1_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t G1_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t G1_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG1BUFFER7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G2_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t G2_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t G2_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG2BUFFER0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G2_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t G2_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t G2_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG2BUFFER1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G2_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t G2_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t G2_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG2BUFFER2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G2_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t G2_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t G2_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG2BUFFER3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G2_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t G2_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t G2_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG2BUFFER4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G2_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t G2_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t G2_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG2BUFFER5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G2_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t G2_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t G2_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG2BUFFER6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G2_DR:12;
      uint64_t reservedSpace0:4;
      uint64_t G2_CHID:5;
      uint64_t reservedSpace1:10;
      uint64_t G2_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG2BUFFER7;

  uint32_t ADEVEMUBUFFER;
  uint32_t ADG1EMUBUFFER;
  uint32_t ADG2EMUBUFFER;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADEVT_DIR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADEVTDIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADEVT_OUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADEVTOUT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADEVT_IN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADEVTIN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADEVT_SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADEVTSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADEVT_CLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADEVTCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADEVT_PDR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADEVPDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADEVT_PDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADEVTPDIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADEVT_PSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADEVTPSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV_SAMP_DIS_EN:1;
      uint64_t reservedSpace0:7;
      uint64_t EV_SAMP_DIS_CYC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADEVSAMPDISEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G1_SAMP_DIS_EN:1;
      uint64_t reservedSpace0:7;
      uint64_t G1_SAMP_DIS_CYC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG1SAMPDISEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G2_SAMP_DIS_EN:1;
      uint64_t reservedSpace0:7;
      uint64_t G2_SAMP_DIS_CYC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG2SAMPDISEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAG_CHID:5;
      uint64_t reservedSpace0:3;
      uint64_t COMP_CHID:5;
      uint64_t reservedSpace1:1;
      uint64_t CMP_GELT:1;
      uint64_t CHNTHR_COMP:1;
      uint64_t MAG_THR:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADMAGINT0CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAG_MASK:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADMAG0MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAG_CHID:5;
      uint64_t reservedSpace0:3;
      uint64_t COMP_CHID:5;
      uint64_t reservedSpace1:1;
      uint64_t CMP_GELT:1;
      uint64_t CHNTHR_COMP:1;
      uint64_t MAG_THR:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADMAGINT1CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAG1_MASK:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADMAG1MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAG_CHID:5;
      uint64_t reservedSpace0:3;
      uint64_t COMP_CHID:5;
      uint64_t reservedSpace1:1;
      uint64_t CMP_GELT:1;
      uint64_t CHNTHR_COMP:1;
      uint64_t MAG_THR:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADMAGINT2CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAG2_MASK:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADMAG2MASK;

  uint8_t res1[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAG_INT_ENA_SET:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADMAGINTENASET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAG_INT_ENA_CLR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADMAGINTENACLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAG_INT_FLG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADMAGINTFLG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAG_INT_OFF:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADMAGINTOFF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV_FIFO_RESET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADEVFIFORESETCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G1_FIFO_RESET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG1FIFORESETCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G2_FIFO_RESET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG2FIFORESETCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV_RAM_ADDR:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADEVRAMWRADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G1_RAM_ADDR:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG1RAMWRADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G2_RAM_ADDR:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG2RAMWRADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARITY_ENA:4;
      uint64_t reservedSpace0:4;
      uint64_t TEST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADPARCR;

  uint32_t ADPARADDR;
};

#define ADC_ADC0 (*(volatile struct ADC_ADC0_tag *) 0xfff7c000)

struct ADC_ADC1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADRSTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_EN:1;
      uint64_t reservedSpace0:15;
      uint64_t RAM_TEST_EN:1;
      uint64_t reservedSpace1:7;
      uint64_t COS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADOPMODECR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADCLOCKCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAL_EN:1;
      uint64_t reservedSpace0:7;
      uint64_t HILO:1;
      uint64_t BRIDGE_EN:1;
      uint64_t reservedSpace1:6;
      uint64_t CAL_ST:1;
      uint64_t reservedSpace2:7;
      uint64_t SELF_TEST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADCALCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRZ_EV:1;
      uint64_t EV_MODE:1;
      uint64_t reservedSpace0:2;
      uint64_t OVR_EV_RAM_IGN:1;
      uint64_t EV_CHID:1;
      uint64_t reservedSpace1:2;
      uint64_t EV_DATA_FMT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADEVMODECR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRZ_G1:1;
      uint64_t G1_MODE:1;
      uint64_t reservedSpace0:1;
      uint64_t G1_HW_TRIG:1;
      uint64_t OVR_G1_RAM_IGN:1;
      uint64_t G1_CHID:1;
      uint64_t reservedSpace1:2;
      uint64_t G1_DATA_FMT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG1MODECR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRZ_G2:1;
      uint64_t G2_MODE:1;
      uint64_t reservedSpace0:1;
      uint64_t G2_HW_TRIG:1;
      uint64_t OVR_G2_RAM_IGN:1;
      uint64_t G2_CHID:1;
      uint64_t reservedSpace1:2;
      uint64_t G2_DATA_FMT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG2MODECR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EVSRC:3;
      uint64_t EV_EDG_SEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADEVSRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G1SRC:3;
      uint64_t G1_EDG_SEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG1SRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G2SRC:3;
      uint64_t G2_EDG_SEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG2SRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV_THR_INT_EN:1;
      uint64_t EV_OVR_INT_EN:1;
      uint64_t reservedSpace0:1;
      uint64_t EV_END_INT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADEVINTENA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G1_THR_INT_EN:1;
      uint64_t G1_OVR_INT_EN:1;
      uint64_t reservedSpace0:1;
      uint64_t G1_END_INT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG1INTENA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G2_THR_INT_EN:1;
      uint64_t G2_OVR_INT_EN:1;
      uint64_t reservedSpace0:1;
      uint64_t G2_END_INT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG2INTENA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV_THR_INT_FLG:1;
      uint64_t EV_MEM_OVERRUN:1;
      uint64_t EV_MEM_EMPTY:1;
      uint64_t EV_END:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADEVINTFLG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G1_THR_INT_FLG:1;
      uint64_t G1_MEM_OVERRUN:1;
      uint64_t G1_MEM_EMPTY:1;
      uint64_t G1_END:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG1INTFLG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G2_THR_INT_FLG:1;
      uint64_t G2_MEM_OVERRUN:1;
      uint64_t G2_MEM_EMPTY:1;
      uint64_t G2_END:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG2INTFLG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV_THR:9;
      uint64_t Sign_Extension:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADEVTHRINTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G1_THR:9;
      uint64_t Sign_Extension:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG1THRINTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G2_THR:9;
      uint64_t Sign_Extension:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG2THRINTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV_DMA_EN:1;
      uint64_t reservedSpace0:1;
      uint64_t EV_BLK_XFER:1;
      uint64_t reservedSpace1:13;
      uint64_t EVBLOCKS:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADEVDMACR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G1_DMA_EN:1;
      uint64_t reservedSpace0:1;
      uint64_t G1_BLK_XFER:1;
      uint64_t reservedSpace1:13;
      uint64_t G1BLOCKS:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG1DMACR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G2_DMA_EN:1;
      uint64_t reservedSpace0:1;
      uint64_t G2_BLK_XFER:1;
      uint64_t reservedSpace1:13;
      uint64_t G2BLOCKS:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG2DMACR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BNDB:9;
      uint64_t reservedSpace0:7;
      uint64_t BNDA:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADBNDCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BNDEND:3;
      uint64_t reservedSpace0:13;
      uint64_t BUF_Init_Active:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADBNDEND;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV_ACQ:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADEVSAMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G1_ACQ:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG1SAMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G2_ACQ:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG2SAMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV_END:1;
      uint64_t EV_STOP:1;
      uint64_t EV_BUSY:1;
      uint64_t EV_MEM_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADEVSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G1_END:1;
      uint64_t G1_STOP:1;
      uint64_t G1_BUSY:1;
      uint64_t G1_MEM_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG1SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G2_END:1;
      uint64_t G2_STOP:1;
      uint64_t G2_BUSY:1;
      uint64_t G2_MEM_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG2SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV_SEL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADEVSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G1_SEL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG1SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G2_SEL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG2SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCALR:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADCALR;

