iSYSTEMLabs/winIDEAExampleWorkspaces/TI/TMS570LS1227/emptyTargetInit/TMS570LS1227_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Message_Number:8;
      uint64_t Word_Number:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_PERR;

  uint8_t res1[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ABO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_ABOTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TxRqstReg1:2;
      uint64_t TxRqstReg2:2;
      uint64_t TxRqstReg3:2;
      uint64_t TxRqstReg4:2;
      uint64_t TxRqstReg5:2;
      uint64_t TxRqstReg6:2;
      uint64_t TxRqstReg7:2;
      uint64_t TxRqstReg8:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_TXRQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TxRqst:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_TXRQ12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TxRqst:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_TXRQ34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TxRqst:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_TXRQ56;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TxRqst:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_TXRQ78;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NewDatReg1:2;
      uint64_t NewDatReg2:2;
      uint64_t NewDatReg3:2;
      uint64_t NewDatReg4:2;
      uint64_t NewDatReg5:2;
      uint64_t NewDatReg6:2;
      uint64_t NewDatReg7:2;
      uint64_t NewDatReg8:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_NWDAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NewDat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_NWDAT12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NewDat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_NWDAT34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NewDat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_NWDAT56;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NewDat:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_NWDAT78;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IntPndReg1:2;
      uint64_t IntPndReg2:2;
      uint64_t IntPndReg3:2;
      uint64_t IntPndReg4:2;
      uint64_t IntPndReg5:2;
      uint64_t IntPndReg6:2;
      uint64_t IntPndReg7:2;
      uint64_t IntPndReg8:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_INTPND;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IntPnd:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_INTPND12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IntPnd:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_INTPND34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IntPnd:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_INTPND56;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IntPnd:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_INTPND78;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSGVALReg1:2;
      uint64_t MSGVALReg2:2;
      uint64_t MSGVALReg3:2;
      uint64_t MSGVALReg4:2;
      uint64_t MSGVALReg5:2;
      uint64_t MSGVALReg6:2;
      uint64_t MSGVALReg7:2;
      uint64_t MSGVALReg8:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_MSGVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_MSGVAL12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_MSGVAL34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_MSGVAL56;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSGVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_MSGVAL78;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTMUX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_INTMUX12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTMUX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_INTMUX34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTMUX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_INTMUX56;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTMUX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_INTMUX78;

  uint8_t res3[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Message_Number:8;
      uint64_t reservedSpace0:6;
      uint64_t DMAactive:1;
      uint64_t Busy:1;
      uint64_t Data_B:1;
      uint64_t Data_A:1;
      uint64_t TxRqstNewDat:1;
      uint64_t ClrIntPnd:1;
      uint64_t Control:1;
      uint64_t Arb:1;
      uint64_t Mask:1;
      uint64_t WRRD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF1CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Msk:29;
      uint64_t reservedSpace0:1;
      uint64_t MDir:1;
      uint64_t MXtd:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF1MSK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:29;
      uint64_t Dir:1;
      uint64_t Xtd:1;
      uint64_t MsgVal:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF1ARB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLC:3;
      uint64_t reservedSpace0:4;
      uint64_t EoB:1;
      uint64_t TxRqst:1;
      uint64_t RmtEn:1;
      uint64_t RxIE:1;
      uint64_t TxIE:1;
      uint64_t UMask:1;
      uint64_t IntPnd:1;
      uint64_t MsgLst:1;
      uint64_t NewDat:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF1MCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Data_0:8;
      uint64_t Data_1:8;
      uint64_t Data_2:8;
      uint64_t Data_3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF1DATA_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Data_4:8;
      uint64_t Data_5:8;
      uint64_t Data_6:8;
      uint64_t Data_7:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF1DATA_1;

