iSYSTEMLabs/winIDEAExampleWorkspaces/TI/TMS570LS1227/emptyTargetInit/TMS570LS1227_sfr.h
  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Message_Number:8;
      uint64_t reservedSpace0:6;
      uint64_t DMAactive:1;
      uint64_t Busy:1;
      uint64_t Data_B:1;
      uint64_t Data_A:1;
      uint64_t TxRqstNewDat:1;
      uint64_t ClrIntPnd:1;
      uint64_t Control:1;
      uint64_t Arb:1;
      uint64_t Mask:1;
      uint64_t WRRD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF2CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Msk:29;
      uint64_t reservedSpace0:1;
      uint64_t MDir:1;
      uint64_t MXtd:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF2MSK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:29;
      uint64_t Dir:1;
      uint64_t Xtd:1;
      uint64_t MsgVal:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF2ARB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLC:3;
      uint64_t reservedSpace0:4;
      uint64_t EoB:1;
      uint64_t TxRqst:1;
      uint64_t RmtEn:1;
      uint64_t RxIE:1;
      uint64_t TxIE:1;
      uint64_t UMask:1;
      uint64_t IntPnd:1;
      uint64_t MsgLst:1;
      uint64_t NewDat:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF2MCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Data_0:8;
      uint64_t Data_1:8;
      uint64_t Data_2:8;
      uint64_t Data_3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF2DATA_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Data_4:8;
      uint64_t Data_5:8;
      uint64_t Data_6:8;
      uint64_t Data_7:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF2DATA_1;

  uint8_t res5[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Mask:1;
      uint64_t Arb:1;
      uint64_t Ctrl:1;
      uint64_t DataA:1;
      uint64_t DataB:1;
      uint64_t reservedSpace0:3;
      uint64_t IF3_0:1;
      uint64_t IF3_1:1;
      uint64_t IF3_2:1;
      uint64_t IF3_3:1;
      uint64_t IF3_4:1;
      uint64_t reservedSpace1:2;
      uint64_t IF3_5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF3OBS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Msk:29;
      uint64_t reservedSpace0:1;
      uint64_t MDir:1;
      uint64_t MXtd:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF3MSK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:29;
      uint64_t Dir:1;
      uint64_t Xtd:1;
      uint64_t MsgVal:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF3ARB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLC:3;
      uint64_t reservedSpace0:4;
      uint64_t EoB:1;
      uint64_t TxRqst:1;
      uint64_t RmtEn:1;
      uint64_t RxIE:1;
      uint64_t TxIE:1;
      uint64_t UMask:1;
      uint64_t IntPnd:1;
      uint64_t MsgLst:1;
      uint64_t NewDat:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF3MCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Data_0:8;
      uint64_t Data_1:8;
      uint64_t Data_2:8;
      uint64_t Data_3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF3DATA_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Data_4:8;
      uint64_t Data_5:8;
      uint64_t Data_6:8;
      uint64_t Data_7:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF3DATA_1;

  uint8_t res6[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IF3UPD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF3UPD12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IF3UPD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF3UPD34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IF3UPD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF3UPD56;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IF3UPD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF3UPD78;

  uint8_t res7[112];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t In:1;
      uint64_t Out:1;
      uint64_t Dir:1;
      uint64_t Func:1;
      uint64_t reservedSpace0:12;
      uint64_t OD:1;
      uint64_t PD:1;
      uint64_t PU:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_TIOC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t In:1;
      uint64_t Out:1;
      uint64_t Dir:1;
      uint64_t Func:1;
      uint64_t reservedSpace0:12;
      uint64_t OD:1;
      uint64_t PD:1;
      uint64_t PU:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_RIOC;

};

#define DCAN_DCAN2 (*(volatile struct DCAN_DCAN2_tag *) 0xfff7de00)

struct DCAN_DCAN3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t Init:1;
      uint64_t IE0:1;
      uint64_t SIE:1;
      uint64_t EIE:1;
      uint64_t reservedSpace0:1;
      uint64_t DAR:1;
      uint64_t CCE:1;
      uint64_t Test:1;
      uint64_t IDS:1;
      uint64_t ABO:1;
      uint64_t PMD:4;
      uint64_t reservedSpace1:1;
      uint64_t SWR:1;
      uint64_t InitDbg:1;
      uint64_t IE1:1;
      uint64_t DE1:1;
      uint64_t DE2:1;
      uint64_t DE3:1;
      uint64_t reservedSpace2:3;
      uint64_t PDR:1;
      uint64_t WUBA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LEC:3;
      uint64_t TxOk:1;
      uint64_t RxOk:1;
      uint64_t EPass:1;
      uint64_t EWarn:1;
      uint64_t BOff:1;
      uint64_t PER:1;
      uint64_t WakeUp_Pnd:1;
      uint64_t PDA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_ES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEC:8;
      uint64_t REC:7;
      uint64_t RP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_ERRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BRP:6;
      uint64_t SJW:2;
      uint64_t TSeg1:4;
      uint64_t TSeg2:3;
      uint64_t reservedSpace0:1;
      uint64_t BRPE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_BTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IntID:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_INT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t Silent:1;
      uint64_t LBack:1;
      uint64_t Tx:2;
      uint64_t Rx:1;
      uint64_t EXL:1;
      uint64_t RDA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_TEST;

