iSYSTEMLabs/winIDEAExampleWorkspaces/TI/TMS570LS1227/emptyTargetInit/TMS570LS1227_sfr.h
  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Message_Number:8;
      uint64_t reservedSpace0:6;
      uint64_t DMAactive:1;
      uint64_t Busy:1;
      uint64_t Data_B:1;
      uint64_t Data_A:1;
      uint64_t TxRqstNewDat:1;
      uint64_t ClrIntPnd:1;
      uint64_t Control:1;
      uint64_t Arb:1;
      uint64_t Mask:1;
      uint64_t WRRD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF2CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Msk:29;
      uint64_t reservedSpace0:1;
      uint64_t MDir:1;
      uint64_t MXtd:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF2MSK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:29;
      uint64_t Dir:1;
      uint64_t Xtd:1;
      uint64_t MsgVal:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF2ARB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLC:3;
      uint64_t reservedSpace0:4;
      uint64_t EoB:1;
      uint64_t TxRqst:1;
      uint64_t RmtEn:1;
      uint64_t RxIE:1;
      uint64_t TxIE:1;
      uint64_t UMask:1;
      uint64_t IntPnd:1;
      uint64_t MsgLst:1;
      uint64_t NewDat:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF2MCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Data_0:8;
      uint64_t Data_1:8;
      uint64_t Data_2:8;
      uint64_t Data_3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF2DATA_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Data_4:8;
      uint64_t Data_5:8;
      uint64_t Data_6:8;
      uint64_t Data_7:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF2DATA_1;

  uint8_t res5[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Mask:1;
      uint64_t Arb:1;
      uint64_t Ctrl:1;
      uint64_t DataA:1;
      uint64_t DataB:1;
      uint64_t reservedSpace0:3;
      uint64_t IF3_0:1;
      uint64_t IF3_1:1;
      uint64_t IF3_2:1;
      uint64_t IF3_3:1;
      uint64_t IF3_4:1;
      uint64_t reservedSpace1:2;
      uint64_t IF3_5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF3OBS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Msk:29;
      uint64_t reservedSpace0:1;
      uint64_t MDir:1;
      uint64_t MXtd:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF3MSK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:29;
      uint64_t Dir:1;
      uint64_t Xtd:1;
      uint64_t MsgVal:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF3ARB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLC:3;
      uint64_t reservedSpace0:4;
      uint64_t EoB:1;
      uint64_t TxRqst:1;
      uint64_t RmtEn:1;
      uint64_t RxIE:1;
      uint64_t TxIE:1;
      uint64_t UMask:1;
      uint64_t IntPnd:1;
      uint64_t MsgLst:1;
      uint64_t NewDat:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF3MCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Data_0:8;
      uint64_t Data_1:8;
      uint64_t Data_2:8;
      uint64_t Data_3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF3DATA_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Data_4:8;
      uint64_t Data_5:8;
      uint64_t Data_6:8;
      uint64_t Data_7:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF3DATA_1;

  uint8_t res6[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IF3UPD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF3UPD12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IF3UPD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF3UPD34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IF3UPD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF3UPD56;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IF3UPD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_IF3UPD78;

  uint8_t res7[112];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t In:1;
      uint64_t Out:1;
      uint64_t Dir:1;
      uint64_t Func:1;
      uint64_t reservedSpace0:12;
      uint64_t OD:1;
      uint64_t PD:1;
      uint64_t PU:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_TIOC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t In:1;
      uint64_t Out:1;
      uint64_t Dir:1;
      uint64_t Func:1;
      uint64_t reservedSpace0:12;
      uint64_t OD:1;
      uint64_t PD:1;
      uint64_t PU:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCAN_RIOC;

};

#define DCAN_DCAN3 (*(volatile struct DCAN_DCAN3_tag *) 0xfff7e000)

struct I2C_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t OA:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2COAR;

  uint8_t res0[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ALEN:1;
      uint64_t NACKEN:1;
      uint64_t ARDYEN:1;
      uint64_t RXRDYEN:1;
      uint64_t TXRDYEN:1;
      uint64_t SCDEN:1;
      uint64_t AASEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2CIMR;

  uint8_t res1[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t AL:1;
      uint64_t NACK:1;
      uint64_t ARDY:1;
      uint64_t RXRDY:1;
      uint64_t TXRDY:1;
      uint64_t SCD:1;
      uint64_t reservedSpace0:2;
      uint64_t AD0:1;
      uint64_t AAS:1;
      uint64_t XSMT:1;
      uint64_t RSFULL:1;
      uint64_t BB:1;
      uint64_t NACKSNT:1;
      uint64_t SDIR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2CSTR;

  uint8_t res2[2];

  uint16_t I2CCKL;
  uint8_t res3[2];

  uint16_t I2CCKH;
  uint8_t res4[2];

  uint16_t I2CCNT;
  uint8_t res5[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DATARX:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2CDRR;

  uint8_t res6[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SA:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2CSAR;

  uint8_t res7[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DATATX:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2CDXR;

  uint8_t res8[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t BC:3;
      uint64_t FDF:1;
      uint64_t STB:1;
      uint64_t nIRS:1;
      uint64_t DLB:1;
      uint64_t RM:1;
      uint64_t XA:1;
      uint64_t TRX:1;
      uint64_t MST:1;
      uint64_t STP:1;
      uint64_t reservedSpace0:1;
      uint64_t STT:1;
      uint64_t FREE:1;
      uint64_t NACKMOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2CMDR;

  uint8_t res9[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t INTCODE:3;
      uint64_t reservedSpace0:5;
      uint64_t TESTMD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2CIVR;

  uint8_t res10[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t BCM:1;
      uint64_t IGNACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2CEMDR;

  uint8_t res11[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PSC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2CPSC;

  uint8_t res12[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t REVISION:8;
      uint64_t CLASS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2CPID1;

  uint8_t res13[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TYPE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2CPID2;

  uint8_t res14[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t RXDMAEN:1;
      uint64_t TXDMAEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2CDMACR;

  uint8_t res15[10];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PINFUNC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2CPFNC;

  uint8_t res16[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SCLDIR:1;
      uint64_t SDADIR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2CPDIR;

  uint8_t res17[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SCLIN:1;
      uint64_t SDAIN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2CDIN;

