iSYSTEMLabs/winIDEAExampleWorkspaces/TI/TMS570LS1227/emptyTargetInit/TMS570LS1227_sfr.h
  uint8_t res18[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SCLOUT:1;
      uint64_t SDAOUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2CDOUT;

  uint8_t res19[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SCLSET:1;
      uint64_t SDASET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2CDSET;

  uint8_t res20[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SCLCLR:1;
      uint64_t SDACLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2CDCLR;

  uint8_t res21[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SCLPDR:1;
      uint64_t SDAPDR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2CPDR;

  uint8_t res22[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SCLPDIS:1;
      uint64_t SDAPDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2CPDIS;

  uint8_t res23[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SCLPSEL:1;
      uint64_t SDAPSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2CPSEL;

  uint8_t res24[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SCLSRS:1;
      uint64_t SDASRS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2CSRS;

};

#define I2C (*(volatile struct I2C_tag *) 0xfff7d400)

struct EMAC_tag
{
  uint32_t TXREVID;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXCONTROL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXTDNCH:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXTEARDOWN;

  uint8_t res0[4];

  uint32_t RXREVID;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXCONTROL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXTDNCH:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXTEARDOWN;

  uint8_t res1[100];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX0PEND:1;
      uint64_t TX1PEND:1;
      uint64_t TX2PEND:1;
      uint64_t TX3PEND:1;
      uint64_t TX4PEND:1;
      uint64_t TX5PEND:1;
      uint64_t TX6PEND:1;
      uint64_t TX7PEND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXINTSTATRAW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX0PEND:1;
      uint64_t TX1PEND:1;
      uint64_t TX2PEND:1;
      uint64_t TX3PEND:1;
      uint64_t TX4PEND:1;
      uint64_t TX5PEND:1;
      uint64_t TX6PEND:1;
      uint64_t TX7PEND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXINTSTATMASKED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX0MASK:1;
      uint64_t TX1MASK:1;
      uint64_t TX2MASK:1;
      uint64_t TX3MASK:1;
      uint64_t TX4MASK:1;
      uint64_t TX5MASK:1;
      uint64_t TX6MASK:1;
      uint64_t TX7MASK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXINTMASKSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX0MASK:1;
      uint64_t TX1MASK:1;
      uint64_t TX2MASK:1;
      uint64_t TX3MASK:1;
      uint64_t TX4MASK:1;
      uint64_t TX5MASK:1;
      uint64_t TX6MASK:1;
      uint64_t TX7MASK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXINTMASKCLEAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXPEND:8;
      uint64_t RXTHRESHPEND:8;
      uint64_t TXPEND:8;
      uint64_t USERINT0:1;
      uint64_t LINKINT0:1;
      uint64_t HOSTPEND:1;
      uint64_t STATPEND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACINVECTOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTVECT:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACEOIVECTOR;

  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX0PEND:1;
      uint64_t RX1PEND:1;
      uint64_t RX2PEND:1;
      uint64_t RX3PEND:1;
      uint64_t RX4PEND:1;
      uint64_t RX5PEND:1;
      uint64_t RX6PEND:1;
      uint64_t RX7PEND:1;
      uint64_t RX0THRESHPEND:1;
      uint64_t RX1THRESHPEND:1;
      uint64_t RX2THRESHPEND:1;
      uint64_t RX3THRESHPEND:1;
      uint64_t RX4THRESHPEND:1;
      uint64_t RX5THRESHPEND:1;
      uint64_t RX6THRESHPEND:1;
      uint64_t RX7THRESHPEND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXINTSTATRAW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX0PEND:1;
      uint64_t RX1PEND:1;
      uint64_t RX2PEND:1;
      uint64_t RX3PEND:1;
      uint64_t RX4PEND:1;
      uint64_t RX5PEND:1;
      uint64_t RX6PEND:1;
      uint64_t RX7PEND:1;
      uint64_t RX0THRESHPEND:1;
      uint64_t RX1THRESHPEND:1;
      uint64_t RX2THRESHPEND:1;
      uint64_t RX3THRESHPEND:1;
      uint64_t RX4THRESHPEND:1;
      uint64_t RX5THRESHPEND:1;
      uint64_t RX6THRESHPEND:1;
      uint64_t RX7THRESHPEND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXINTSTATMASKED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX0MASK:1;
      uint64_t RX1MASK:1;
      uint64_t RX2MASK:1;
      uint64_t RX3MASK:1;
      uint64_t RX4MASK:1;
      uint64_t RX5MASK:1;
      uint64_t RX6MASK:1;
      uint64_t RX7MASK:1;
      uint64_t RX0THRESHMASK:1;
      uint64_t RX1THRESHMASK:1;
      uint64_t RX2THRESHMASK:1;
      uint64_t RX3THRESHMASK:1;
      uint64_t RX4THRESHMASK:1;
      uint64_t RX5THRESHMASK:1;
      uint64_t RX6THRESHMASK:1;
      uint64_t RX7THRESHMASK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXINTMASKSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX0MASK:1;
      uint64_t RX1MASK:1;
      uint64_t RX2MASK:1;
      uint64_t RX3MASK:1;
      uint64_t RX4MASK:1;
      uint64_t RX5MASK:1;
      uint64_t RX6MASK:1;
      uint64_t RX7MASK:1;
      uint64_t RX0THRESHMASK:1;
      uint64_t RX1THRESHMASK:1;
      uint64_t RX2THRESHMASK:1;
      uint64_t RX3THRESHMASK:1;
      uint64_t RX4THRESHMASK:1;
      uint64_t RX5THRESHMASK:1;
      uint64_t RX6THRESHMASK:1;
      uint64_t RX7THRESHMASK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXINTMASKCLEAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATPEND:1;
      uint64_t HOSTPEND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACINTSTATRAW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATPEND:1;
      uint64_t HOSTPEND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACINTSTATMASKED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATPEND:1;
      uint64_t HOSTPEND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACINTMASKSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATPEND:1;
      uint64_t HOSTPEND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACINTMASKCLEAR;

  uint8_t res3[64];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXMULTCH:3;
      uint64_t reservedSpace0:2;
      uint64_t RXMULTEN:1;
      uint64_t reservedSpace1:2;
      uint64_t RXBROADCH:3;
      uint64_t reservedSpace2:2;
      uint64_t RXBROADEN:1;
      uint64_t reservedSpace3:2;
      uint64_t RXPROMCH:3;
      uint64_t reservedSpace4:2;
      uint64_t RXCAFEN:1;
      uint64_t RXCEFEN:1;
      uint64_t RXCSFEN:1;
      uint64_t RXCMFEN:1;
      uint64_t reservedSpace5:3;
      uint64_t RXNOCHAIN:1;
      uint64_t RXQOSEN:1;
      uint64_t RXPASSCRC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXMBPENABLE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXCH0EN:1;
      uint64_t RXCH1EN:1;
      uint64_t RXCH2EN:1;
      uint64_t RXCH3EN:1;
      uint64_t RXCH4EN:1;
      uint64_t RXCH5EN:1;
      uint64_t RXCH6EN:1;
      uint64_t RXCH7EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXUNICASTSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXCH0EN:1;
      uint64_t RXCH1EN:1;
      uint64_t RXCH2EN:1;
      uint64_t RXCH3EN:1;
      uint64_t RXCH4EN:1;
      uint64_t RXCH5EN:1;
      uint64_t RXCH6EN:1;
      uint64_t RXCH7EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXUNICASTCLEAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXMAXLEN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXMAXLEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXBUFFEROFFSET:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXBUFFEROFFSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXFILTERTHRESH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXFILTERLOWTHRESH;

