iSYSTEMLabs/winIDEAExampleWorkspaces/TI/TMS570LS1227/emptyTargetInit/TMS570LS1227_sfr.h
  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX0FLOWTHRESH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX0FLOWTHRESH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX1FLOWTHRESH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX1FLOWTHRESH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX2FLOWTHRESH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX2FLOWTHRESH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX3FLOWTHRESH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX3FLOWTHRESH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX4FLOWTHRESH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX4FLOWTHRESH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX5FLOWTHRESH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX5FLOWTHRESH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX6FLOWTHRESH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX6FLOWTHRESH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX7FLOWTHRESH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX7FLOWTHRESH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX0FREEBUF:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX0FREEBUFFER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX1FREEBUF:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX1FREEBUFFER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX2FREEBUF:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX2FREEBUFFER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX3FREEBUF:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX3FREEBUFFER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX4FREEBUF:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX4FREEBUFFER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX5FREEBUF:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX5FREEBUFFER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX6FREEBUF:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX6FREEBUFFER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX7FREEBUF:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX7FREEBUFFER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FULLDUPLEX:1;
      uint64_t LOOPBACK:1;
      uint64_t reservedSpace0:1;
      uint64_t RXBUFFERFLOWEN:1;
      uint64_t TXFLOWEN:1;
      uint64_t GMIIEN:1;
      uint64_t TXPACE:1;
      uint64_t reservedSpace1:2;
      uint64_t TXPTYPE:1;
      uint64_t TXSHORTGAPEN:1;
      uint64_t CMDIDLE:1;
      uint64_t reservedSpace2:1;
      uint64_t RXOWNERSHIP:1;
      uint64_t RXOFFLENBLOCK:1;
      uint64_t RMIISPEED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACCONTROL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXFLOWACT:1;
      uint64_t RXFLOWACT:1;
      uint64_t RXQOSACT:1;
      uint64_t reservedSpace0:5;
      uint64_t RXERRCH:3;
      uint64_t reservedSpace1:1;
      uint64_t RXERRCODE:4;
      uint64_t TXERRCH:3;
      uint64_t reservedSpace2:1;
      uint64_t TXERRCODE:4;
      uint64_t reservedSpace3:7;
      uint64_t IDLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACSTATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FREE:1;
      uint64_t SOFT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMCONTROL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXCELLTHRESH:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOCONTROL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACCFIG:8;
      uint64_t ADDRESSTYPE:8;
      uint64_t RXCELLDEPTH:8;
      uint64_t TXCELLDEPTH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACCONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SOFTRESET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SOFTRESET_0;

  uint8_t res5[88];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACSRCADDR1:8;
      uint64_t MACSRCADDR0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACSRCADDRLO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACSRCADDR5:8;
      uint64_t MACSRCADDR4:8;
      uint64_t MACSRCADDR3:8;
      uint64_t MACSRCADDR2:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACSRCADDRHI;

  uint32_t MACHASH1;
  uint32_t MACHASH2;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXBACKOFF:10;
      uint64_t reservedSpace0:2;
      uint64_t COLLCOUNT:4;
      uint64_t RNDNUM:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BOFFTEST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PACEVAL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TPACETEST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAUSETIMER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXPAUSE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAUSETIMER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TXPAUSE;

  uint8_t res6[16];

  uint32_t RXGOODFRAMES;
  uint32_t RXBCASTFRAMES;
  uint32_t RXMCASTFRAMES;
  uint32_t RXPAUSEFRAMES;
  uint32_t RXCRCERRORS;
  uint32_t RXALIGNCODEERRORS;
  uint32_t RXOVERSIZED;
  uint32_t RXJABBER;
  uint32_t RXUNDERSIZED;
  uint32_t RXFRAGMENTS;
  uint32_t RXFILTERED;
  uint32_t RXQOSFILTERED;
  uint32_t RXOCTETS;
  uint32_t TXGOODFRAMES;
  uint32_t TXBCASTFRAMES;
  uint32_t TXMCASTFRAMES;
  uint32_t TXPAUSEFRAMES;
  uint32_t TXDEFERRED;
  uint32_t TXCOLLISION;
  uint32_t TXSINGLECOLL;
  uint32_t TXMULTICOLL;
  uint32_t TXEXCESSIVECOLL;
  uint32_t TXLATECOLL;
  uint32_t TXUNDERRUN;
  uint32_t TXCARRIERSENSE;
  uint32_t TXOCTETS;
  uint32_t FRAME64;
  uint32_t FRAME65T127;
  uint32_t FRAME128T255;
  uint32_t FRAME256T511;
  uint32_t FRAME512T1023;
  uint32_t FRAME1024TUP;
  uint32_t NETOCTETS;
  uint32_t RXSOFOVERRUNS;
  uint32_t RXMOFOVERRUNS;
  uint32_t RXDMAOVERRUNS;
  uint8_t res7[624];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACADDR1:8;
      uint64_t MACADDR0:8;
      uint64_t CHANNEL:3;
      uint64_t MATCHFILT:1;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACADDRLO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACADDR5:8;
      uint64_t MACADDR4:8;
      uint64_t MACADDR3:8;
      uint64_t MACADDR2:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACADDRHI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACINDEX:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACINDEX;

  uint8_t res8[244];

