iSYSTEMLabs/winIDEAExampleWorkspaces/TI/TMS570LS1227/emptyTargetInit/TMS570LS1227_sfr.h
  uint32_t TX0HDP;
  uint32_t TX1HDP;
  uint32_t TX2HDP;
  uint32_t TX3HDP;
  uint32_t TX4HDP;
  uint32_t TX5HDP;
  uint32_t TX6HDP;
  uint32_t TX7HDP;
  uint32_t RX0HDP;
  uint32_t RX1HDP;
  uint32_t RX2HDP;
  uint32_t RX3HDP;
  uint32_t RX4HDP;
  uint32_t RX5HDP;
  uint32_t RX6HDP;
  uint32_t RX7HDP;
  uint32_t TX0CP;
  uint32_t TX1CP;
  uint32_t TX2CP;
  uint32_t TX3CP;
  uint32_t TX4CP;
  uint32_t TX5CP;
  uint32_t TX6CP;
  uint32_t TX7CP;
  uint32_t RX0CP;
  uint32_t RX1CP;
  uint32_t RX2CP;
  uint32_t RX3CP;
  uint32_t RX4CP;
  uint32_t RX5CP;
  uint32_t RX6CP;
  uint32_t RX7CP;
  uint8_t res9[384];

  uint32_t REVID;
  uint32_t SOFTRESET_1;
  uint8_t res10[4];

  uint32_t INTCONTROL;
  uint32_t C0RXTHRESHEN;
  uint32_t C0RXEN;
  uint32_t C0TXEN;
  uint32_t C0MISCEN;
  uint8_t res11[32];

  uint32_t C0RXTHRESHSTAT;
  uint32_t C0RXSTAT;
  uint32_t C0TXSTAT;
  uint32_t C0MISCSTAT;
  uint8_t res12[32];

  uint32_t C0RXIMAX;
  uint32_t C0TXIMAX;
};

#define EMAC (*(volatile struct EMAC_tag *) 0xfcf78000)

struct MDIO_tag
{
  uint32_t REVID;
  uint32_t CONTROL;
  uint32_t ALIVE;
  uint32_t LINK;
  uint32_t LINKINTRAW;
  uint32_t LINKINTMASKED;
  uint8_t res0[8];

  uint32_t USERINTRAW;
  uint32_t USERINTMASKED;
  uint32_t USERINTMASKSET;
  uint32_t USERINTMASKCLEAR;
  uint8_t res1[80];

  uint32_t USERACCESS0;
  uint32_t USERPHYSEL0;
  uint32_t USERACCESS1;
  uint32_t USERPHYSEL1;
};

#define MDIO (*(volatile struct MDIO_tag *) 0xfcf78900)

struct FTU_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSO:14;
      uint64_t TPTCC:1;
      uint64_t THTCC:1;
      uint64_t TPTSM:1;
      uint64_t THTSM:1;
      uint64_t STXR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCR;

  uint8_t res0[508];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAB0:1;
      uint64_t reservedSpace0:7;
      uint64_t PAB1:1;
      uint64_t reservedSpace1:7;
      uint64_t PAB2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Parity_Information_in_TCR_Parity_Test_Mode;

  uint8_t res1[10984956];

  uint32_t GSN0;
  uint32_t GSN1;
  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TUE:1;
      uint64_t TUH:1;
      uint64_t reservedSpace0:2;
      uint64_t EILE:1;
      uint64_t SILE:1;
      uint64_t reservedSpace1:2;
      uint64_t ETSM:1;
      uint64_t reservedSpace2:3;
      uint64_t CTTSM:1;
      uint64_t CTTCC:1;
      uint64_t CETESM:1;
      uint64_t reservedSpace3:1;
      uint64_t PAL:4;
      uint64_t PFT:1;
      uint64_t PRIO:1;
      uint64_t reservedSpace4:2;
      uint64_t ENDP:2;
      uint64_t ENDH:2;
      uint64_t ENDR:2;
      uint64_t ENDVBS:1;
      uint64_t ENDVBM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TUE:1;
      uint64_t TUH:1;
      uint64_t reservedSpace0:2;
      uint64_t EILE:1;
      uint64_t SILE:1;
      uint64_t reservedSpace1:2;
      uint64_t ETSM:1;
      uint64_t reservedSpace2:3;
      uint64_t CTTSM:1;
      uint64_t CTTCC:1;
      uint64_t CETESM:1;
      uint64_t reservedSpace3:1;
      uint64_t PAL:4;
      uint64_t PFT:1;
      uint64_t PRIO:1;
      uint64_t reservedSpace4:2;
      uint64_t ENDP:2;
      uint64_t ENDH:2;
      uint64_t ENDR:2;
      uint64_t ENDVBS:1;
      uint64_t ENDVBM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BN:7;
      uint64_t reservedSpace0:1;
      uint64_t IDLE:1;
      uint64_t reservedSpace1:3;
      uint64_t STUH:1;
      uint64_t reservedSpace2:3;
      uint64_t TSMS:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TSCB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BN:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LTBCC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BN:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LTBSM;

  uint32_t TBA;
  uint32_t NTBA;
  uint32_t BAMS;
  uint32_t SAMP;
  uint32_t EAMP;
  uint8_t res3[8];

  uint32_t TSMO1;
  uint32_t TSMO2;
  uint32_t TSMO3;
  uint32_t TSMO4;
  uint32_t TCCO1;
  uint32_t TCCO2;
  uint32_t TCCO3;
  uint32_t TCCO4;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFF:8;
      uint64_t TDIR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TOOFF;

  uint8_t res4[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADR:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEADR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FAC:1;
      uint64_t TNR:1;
      uint64_t reservedSpace0:2;
      uint64_t SSTAT:3;
      uint64_t reservedSpace1:1;
      uint64_t RSTAT:3;
      uint64_t reservedSpace2:5;
      uint64_t PE:1;
      uint64_t MPV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FACE:1;
      uint64_t TNRE:1;
      uint64_t reservedSpace0:2;
      uint64_t SSTATE:3;
      uint64_t reservedSpace1:1;
      uint64_t RSTATE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEIRES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FACE:1;
      uint64_t TNRE:1;
      uint64_t reservedSpace0:2;
      uint64_t SSTATE:3;
      uint64_t reservedSpace1:1;
      uint64_t RSTATE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEIRER;

  uint32_t TTSMS1;
  uint32_t TTSMR1;
  uint32_t TTSMS2;
  uint32_t TTSMR2;
  uint32_t TTSMS3;
  uint32_t TTSMR3;
  uint32_t TTSMS4;
  uint32_t TTSMR4;
  uint32_t TTCCS1;
  uint32_t TTCCR1;
  uint32_t TTCCS2;
  uint32_t TTCCR2;
  uint32_t TTCCS3;
  uint32_t TTCCR3;
  uint32_t TTCCS4;
  uint32_t TTCCR4;
  uint32_t ETESMS1;
  uint32_t ETESMR1;
  uint32_t ETESMS2;
  uint32_t ETESMR2;
  uint32_t ETESMS3;
  uint32_t ETESMR3;
  uint32_t ETESMS4;
  uint32_t ETESMR4;
  uint32_t CESMS1;
  uint32_t CESMR1;
  uint32_t CESMS2;
  uint32_t CESMR2;
  uint32_t CESMS3;
  uint32_t CESMR3;
  uint32_t CESMS4;
  uint32_t CESMR4;
  uint32_t TSMIES1;
  uint32_t TSMIER1;
  uint32_t TSMIES2;
  uint32_t TSMIER2;
  uint32_t TSMIES3;
  uint32_t TSMIER3;
  uint32_t TSMIES4;
  uint32_t TSMIER4;
  uint32_t TCCIES1;
  uint32_t TCCIER1;
  uint32_t TCCIES2;
  uint32_t TCCIER2;
  uint32_t TCCIES3;
  uint32_t TCCIER3;
  uint32_t TCCIES4;
  uint32_t TCCIER4;
};

#define FTU (*(volatile struct FTU_tag *) 0xff500000)

