iSYSTEMLabs/winIDEAExampleWorkspaces/TI/TMS570LS1227/emptyTargetInit/TMS570LS1227_sfr.h
struct FlexRay_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRTEN:1;
      uint64_t ELBE:1;
      uint64_t reservedSpace0:2;
      uint64_t TMC:2;
      uint64_t reservedSpace1:2;
      uint64_t AOA:1;
      uint64_t AOB:1;
      uint64_t reservedSpace2:6;
      uint64_t RXA:1;
      uint64_t RXB:1;
      uint64_t TXA:1;
      uint64_t TXB:1;
      uint64_t TXENA:1;
      uint64_t TXENB:1;
      uint64_t reservedSpace3:2;
      uint64_t CERA:4;
      uint64_t CERB:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RS:3;
      uint64_t reservedSpace0:1;
      uint64_t SSEL:3;
      uint64_t reservedSpace1:7;
      uint64_t WRPB:1;
      uint64_t RDPB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST2;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK:8;
      uint64_t TMK:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PEMC:1;
      uint64_t CNA:1;
      uint64_t SFBM:1;
      uint64_t SFO:1;
      uint64_t CCF:1;
      uint64_t CCL:1;
      uint64_t PERR:1;
      uint64_t RFO:1;
      uint64_t EFA:1;
      uint64_t IIBA:1;
      uint64_t IOBA:1;
      uint64_t MHF:1;
      uint64_t reservedSpace0:4;
      uint64_t EDA:1;
      uint64_t LTVA:1;
      uint64_t TABA:1;
      uint64_t reservedSpace1:5;
      uint64_t EDB:1;
      uint64_t LTVB:1;
      uint64_t TABB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WST:1;
      uint64_t CAS:1;
      uint64_t CYCS:1;
      uint64_t TXI:1;
      uint64_t RXI:1;
      uint64_t RFNE:1;
      uint64_t RFCL:1;
      uint64_t NMVC:1;
      uint64_t TI0:1;
      uint64_t TI1:1;
      uint64_t TIBC:1;
      uint64_t TOBC:1;
      uint64_t SWE:1;
      uint64_t SUCS:1;
      uint64_t MBSI:1;
      uint64_t SDS:1;
      uint64_t WUPA:1;
      uint64_t MTSA:1;
      uint64_t reservedSpace0:6;
      uint64_t WUPB:1;
      uint64_t MTSB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PEMCL:1;
      uint64_t CNAL:1;
      uint64_t SFBML:1;
      uint64_t SFOL:1;
      uint64_t CCFL:1;
      uint64_t CCLL:1;
      uint64_t PERRL:1;
      uint64_t RFOL:1;
      uint64_t EFAL:1;
      uint64_t IIBAL:1;
      uint64_t IOBAL:1;
      uint64_t MHFL:1;
      uint64_t reservedSpace0:4;
      uint64_t EDAL:1;
      uint64_t LTVAL:1;
      uint64_t TABAL:1;
      uint64_t reservedSpace1:5;
      uint64_t EDBL:1;
      uint64_t LTVBL:1;
      uint64_t TABBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EILS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSTL:1;
      uint64_t CASL:1;
      uint64_t CYCSL:1;
      uint64_t TXIL:1;
      uint64_t RXIL:1;
      uint64_t RFNEL:1;
      uint64_t RFCLL:1;
      uint64_t NMVCL:1;
      uint64_t TI0L:1;
      uint64_t TI1L:1;
      uint64_t TIBCL:1;
      uint64_t TOBCL:1;
      uint64_t SWEL:1;
      uint64_t SUCSL:1;
      uint64_t MBSIL:1;
      uint64_t SDSL:1;
      uint64_t WUPAL:1;
      uint64_t MTSAL:1;
      uint64_t reservedSpace0:6;
      uint64_t WUPBL:1;
      uint64_t MTSBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SILS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PEMCE:1;
      uint64_t CNAE:1;
      uint64_t SFBME:1;
      uint64_t SFOE:1;
      uint64_t CCFE:1;
      uint64_t CCLE:1;
      uint64_t PERRE:1;
      uint64_t RFOE:1;
      uint64_t EFAE:1;
      uint64_t IIBAE:1;
      uint64_t IOBAE:1;
      uint64_t MHFE:1;
      uint64_t reservedSpace0:4;
      uint64_t EDAE:1;
      uint64_t LTVAE:1;
      uint64_t TABAE:1;
      uint64_t reservedSpace1:5;
      uint64_t EDBE:1;
      uint64_t LTVBE:1;
      uint64_t TABBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PEMCE:1;
      uint64_t CNAE:1;
      uint64_t SFBME:1;
      uint64_t SFOE:1;
      uint64_t CCFE:1;
      uint64_t CCLE:1;
      uint64_t PERRE:1;
      uint64_t RFOE:1;
      uint64_t EFAE:1;
      uint64_t IIBAE:1;
      uint64_t IOBAE:1;
      uint64_t MHFE:1;
      uint64_t reservedSpace0:4;
      uint64_t EDAE:1;
      uint64_t LTVAE:1;
      uint64_t TABAE:1;
      uint64_t reservedSpace1:5;
      uint64_t EDBE:1;
      uint64_t LTVBE:1;
      uint64_t TABBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSTE:1;
      uint64_t CASE:1;
      uint64_t CYCSE:1;
      uint64_t TXIE:1;
      uint64_t RXIE:1;
      uint64_t RFNEE:1;
      uint64_t RFCLE:1;
      uint64_t NMVCE:1;
      uint64_t TI0E:1;
      uint64_t TI1E:1;
      uint64_t TIBCE:1;
      uint64_t TOBCE:1;
      uint64_t SWEE:1;
      uint64_t SUCSE:1;
      uint64_t MBSIE:1;
      uint64_t SDSE:1;
      uint64_t WUPAE:1;
      uint64_t MTSAE:1;
      uint64_t reservedSpace0:6;
      uint64_t WUPBE:1;
      uint64_t MTSBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSTE:1;
      uint64_t CASE:1;
      uint64_t CYCSE:1;
      uint64_t TXIE:1;
      uint64_t RXIE:1;
      uint64_t RFNEE:1;
      uint64_t RFCLE:1;
      uint64_t NMVCE:1;
      uint64_t TI0E:1;
      uint64_t TI1E:1;
      uint64_t TIBCE:1;
      uint64_t TOBCE:1;
      uint64_t SWEE:1;
      uint64_t SUCSE:1;
      uint64_t MBSIE:1;
      uint64_t SDSE:1;
      uint64_t WUPAE:1;
      uint64_t MTSAE:1;
      uint64_t reservedSpace0:6;
      uint64_t WUPBE:1;
      uint64_t MTSBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EINT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ILE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TORC:1;
      uint64_t TOMS:1;
      uint64_t reservedSpace0:6;
      uint64_t TOCC:8;
      uint64_t TOMO:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) T0C;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T1RC:1;
      uint64_t T1MS:1;
      uint64_t reservedSpace0:14;
      uint64_t TIMC:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) T1C;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ESWT:1;
      uint64_t SWMS:1;
      uint64_t EDGE:1;
      uint64_t SSWT:1;
      uint64_t EETP:1;
      uint64_t EINT0:1;
      uint64_t EINT1:1;
      uint64_t reservedSpace0:1;
      uint64_t SCCV:6;
      uint64_t reservedSpace1:2;
      uint64_t SMTV:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STPW1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSCVA:11;
      uint64_t reservedSpace0:5;
      uint64_t SSCVB:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STPW2;

  uint8_t res1[44];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMD:4;
      uint64_t reservedSpace0:3;
      uint64_t PBSY:1;
      uint64_t TXST:1;
      uint64_t TXSY:1;
      uint64_t reservedSpace1:1;
      uint64_t CSA:5;
      uint64_t PTA:4;
      uint64_t PTA4:1;
      uint64_t WUCS:1;
      uint64_t TSM:1;
      uint64_t HCSE:1;
      uint64_t MTSA:1;
      uint64_t MTSB:1;
      uint64_t CCHA:1;
      uint64_t CCHB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SUCC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LT:21;
      uint64_t reservedSpace0:3;
      uint64_t LTN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SUCC2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WCP:4;
      uint64_t WCF:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SUCC3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NML:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NEMC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSST:4;
      uint64_t CASM:7;
      uint64_t reservedSpace0:1;
      uint64_t SPP:2;
      uint64_t BRP:2;
      uint64_t RXW:9;
      uint64_t reservedSpace1:1;
      uint64_t RPW:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRTC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXI:6;
      uint64_t reservedSpace0:2;
      uint64_t RXL:6;
      uint64_t reservedSpace1:2;
      uint64_t TXI:8;
      uint64_t TXL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRTC2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SFDL:7;
      uint64_t reservedSpace0:9;
      uint64_t SLT:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MHDC;

