iSYSTEMLabs/winIDEAExampleWorkspaces/TI/TMS570LS1227/emptyTargetInit/TMS570LS1227_sfr.h
  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UT:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GTUC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPC:14;
      uint64_t reservedSpace0:2;
      uint64_t SNM:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GTUC2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UIOA:8;
      uint64_t UIOB:8;
      uint64_t MIOA:7;
      uint64_t reservedSpace0:1;
      uint64_t MIOB:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GTUC3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NIT:14;
      uint64_t reservedSpace0:2;
      uint64_t OCS:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GTUC4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCA:8;
      uint64_t DCB:8;
      uint64_t CDD:5;
      uint64_t reservedSpace0:3;
      uint64_t DEC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GTUC5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ASR:11;
      uint64_t reservedSpace0:5;
      uint64_t MOD:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GTUC6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSL:10;
      uint64_t reservedSpace0:6;
      uint64_t NSS:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GTUC7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSL:6;
      uint64_t reservedSpace0:10;
      uint64_t NMS:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GTUC8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t APO:6;
      uint64_t reservedSpace0:2;
      uint64_t MAPO:5;
      uint64_t reservedSpace1:3;
      uint64_t DSI:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GTUC9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOC:14;
      uint64_t reservedSpace0:2;
      uint64_t MRC:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GTUC10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOCC:2;
      uint64_t reservedSpace0:6;
      uint64_t ERCC:2;
      uint64_t reservedSpace1:6;
      uint64_t EOC:3;
      uint64_t reservedSpace2:5;
      uint64_t ERC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GTUC11;

  uint8_t res3[52];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POCS:6;
      uint64_t FSI:1;
      uint64_t HQR:1;
      uint64_t SLM:2;
      uint64_t reservedSpace0:2;
      uint64_t CSNI:1;
      uint64_t CSAI:1;
      uint64_t CSI:1;
      uint64_t reservedSpace1:1;
      uint64_t WSV:3;
      uint64_t RCA:5;
      uint64_t PSL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCSV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCFC:4;
      uint64_t reservedSpace0:2;
      uint64_t ERRM:2;
      uint64_t PTAC:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCEV;

  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCCA:11;
      uint64_t reservedSpace0:5;
      uint64_t SCCB:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MTV:14;
      uint64_t reservedSpace0:2;
      uint64_t CCV:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MTCCV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RCV:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OCV:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OCV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VSAE:4;
      uint64_t VSAO:4;
      uint64_t VSBE:4;
      uint64_t VSBO:4;
      uint64_t MOCS:1;
      uint64_t OCLR:1;
      uint64_t MRCS:1;
      uint64_t RCLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SESA:1;
      uint64_t SBSA:1;
      uint64_t TCSA:1;
      uint64_t SESB:1;
      uint64_t SBSB:1;
      uint64_t TCSB:1;
      uint64_t MTSA:1;
      uint64_t MTSB:1;
      uint64_t SENA:1;
      uint64_t SBNA:1;
      uint64_t SENB:1;
      uint64_t SBNB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SWNIT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VFRA:1;
      uint64_t SEDA:1;
      uint64_t CEDA:1;
      uint64_t CIA:1;
      uint64_t SBVA:1;
      uint64_t reservedSpace0:3;
      uint64_t VFRB:1;
      uint64_t SEDB:1;
      uint64_t CEDB:1;
      uint64_t CIB:1;
      uint64_t SBVB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ACS;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EID:10;
      uint64_t reservedSpace0:4;
      uint64_t RXEA:1;
      uint64_t RXEB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESID1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EID:10;
      uint64_t reservedSpace0:4;
      uint64_t RXEA:1;
      uint64_t RXEB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESID2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EID:10;
      uint64_t reservedSpace0:4;
      uint64_t RXEA:1;
      uint64_t RXEB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESID3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EID:10;
      uint64_t reservedSpace0:4;
      uint64_t RXEA:1;
      uint64_t RXEB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESID4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EID:10;
      uint64_t reservedSpace0:4;
      uint64_t RXEA:1;
      uint64_t RXEB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESID5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EID:10;
      uint64_t reservedSpace0:4;
      uint64_t RXEA:1;
      uint64_t RXEB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESID6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EID:10;
      uint64_t reservedSpace0:4;
      uint64_t RXEA:1;
      uint64_t RXEB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESID7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EID:10;
      uint64_t reservedSpace0:4;
      uint64_t RXEA:1;
      uint64_t RXEB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESID8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EID:10;
      uint64_t reservedSpace0:4;
      uint64_t RXEA:1;
      uint64_t RXEB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESID9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EID:10;
      uint64_t reservedSpace0:4;
      uint64_t RXEA:1;
      uint64_t RXEB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESID10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EID:10;
      uint64_t reservedSpace0:4;
      uint64_t RXEA:1;
      uint64_t RXEB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESID11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EID:10;
      uint64_t reservedSpace0:4;
      uint64_t RXEA:1;
      uint64_t RXEB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESID12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EID:10;
      uint64_t reservedSpace0:4;
      uint64_t RXEA:1;
      uint64_t RXEB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESID13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EID:10;
      uint64_t reservedSpace0:4;
      uint64_t RXEA:1;
      uint64_t RXEB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESID14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EID:10;
      uint64_t reservedSpace0:4;
      uint64_t RXEA:1;
      uint64_t RXEB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESID15;

