iSYSTEMLabs/winIDEAExampleWorkspaces/TI/TMS570LS1227/emptyTargetInit/TMS570LS1227_sfr.h
  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OID:10;
      uint64_t reservedSpace0:4;
      uint64_t RXOA:1;
      uint64_t RXOB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSID1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OID:10;
      uint64_t reservedSpace0:4;
      uint64_t RXOA:1;
      uint64_t RXOB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSID2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OID:10;
      uint64_t reservedSpace0:4;
      uint64_t RXOA:1;
      uint64_t RXOB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSID3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OID:10;
      uint64_t reservedSpace0:4;
      uint64_t RXOA:1;
      uint64_t RXOB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSID4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OID:10;
      uint64_t reservedSpace0:4;
      uint64_t RXOA:1;
      uint64_t RXOB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSID5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OID:10;
      uint64_t reservedSpace0:4;
      uint64_t RXOA:1;
      uint64_t RXOB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSID6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OID:10;
      uint64_t reservedSpace0:4;
      uint64_t RXOA:1;
      uint64_t RXOB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSID7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OID:10;
      uint64_t reservedSpace0:4;
      uint64_t RXOA:1;
      uint64_t RXOB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSID8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OID:10;
      uint64_t reservedSpace0:4;
      uint64_t RXOA:1;
      uint64_t RXOB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSID9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OID:10;
      uint64_t reservedSpace0:4;
      uint64_t RXOA:1;
      uint64_t RXOB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSID10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OID:10;
      uint64_t reservedSpace0:4;
      uint64_t RXOA:1;
      uint64_t RXOB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSID11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OID:10;
      uint64_t reservedSpace0:4;
      uint64_t RXOA:1;
      uint64_t RXOB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSID12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OID:10;
      uint64_t reservedSpace0:4;
      uint64_t RXOA:1;
      uint64_t RXOB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSID13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OID:10;
      uint64_t reservedSpace0:4;
      uint64_t RXOA:1;
      uint64_t RXOB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSID14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OID:10;
      uint64_t reservedSpace0:4;
      uint64_t RXOA:1;
      uint64_t RXOB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSID15;

  uint8_t res7[4];

  uint32_t NMV1;
  uint32_t NMV2;
  uint32_t NMV3;
  uint8_t res8[324];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FDB:4;
      uint64_t reservedSpace0:4;
      uint64_t FFB:4;
      uint64_t reservedSpace1:4;
      uint64_t LCB:4;
      uint64_t reservedSpace2:4;
      uint64_t SEC:2;
      uint64_t SPLM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH:2;
      uint64_t FID:11;
      uint64_t reservedSpace0:3;
      uint64_t CYF:7;
      uint64_t RSS:1;
      uint64_t RNF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t MFID:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRFM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PIBF:1;
      uint64_t POBF:1;
      uint64_t PMR:1;
      uint64_t PTFB1:1;
      uint64_t PTFB2:1;
      uint64_t FMBD:1;
      uint64_t MFMB:1;
      uint64_t CRAM:1;
      uint64_t FMB:7;
      uint64_t reservedSpace0:1;
      uint64_t MBT:7;
      uint64_t reservedSpace1:1;
      uint64_t MBU:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MHDS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LDTA:11;
      uint64_t reservedSpace0:5;
      uint64_t LDTB:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LDTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFNE:1;
      uint64_t RFCL:1;
      uint64_t RFO:1;
      uint64_t reservedSpace0:5;
      uint64_t RFFL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SNUA:1;
      uint64_t SNUB:1;
      uint64_t FNFA:1;
      uint64_t FNFB:1;
      uint64_t TBFA:1;
      uint64_t TBFB:1;
      uint64_t TNSB:1;
      uint64_t TNSA:1;
      uint64_t WAHP:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MHDF;

  uint32_t TXRQ1;
  uint32_t TXRQ2;
  uint32_t TXRQ3;
  uint32_t TXRQ4;
  uint32_t NDAT1;
  uint32_t NDAT2;
  uint32_t NDAT3;
  uint32_t NDAT4;
  uint32_t MBSC1;
  uint32_t MBSC2;
  uint32_t MBSC3;
  uint32_t MBSC4;
  uint8_t res9[160];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAY:8;
      uint64_t MON:8;
      uint64_t YEAR:4;
      uint64_t STEP:8;
      uint64_t REL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CREL;

  uint32_t ENDN;
  uint8_t res10[8];

  uint32_t Write_Data_Section_1;
  uint32_t Write_Data_Section_2;
  uint32_t Write_Data_Section_3;
  uint32_t Write_Data_Section_4;
  uint32_t Write_Data_Section_5;
  uint32_t Write_Data_Section_6;
  uint32_t Write_Data_Section_7;
  uint32_t Write_Data_Section_8;
  uint32_t Write_Data_Section_9;
  uint32_t Write_Data_Section_10;
  uint32_t Write_Data_Section_11;
  uint32_t Write_Data_Section_12;
  uint32_t Write_Data_Section_13;
  uint32_t Write_Data_Section_14;
  uint32_t Write_Data_Section_15;
  uint32_t Write_Data_Section_16;
  uint32_t Write_Data_Section_17;
  uint32_t Write_Data_Section_18;
  uint32_t Write_Data_Section_19;
  uint32_t Write_Data_Section_20;
  uint32_t Write_Data_Section_21;
  uint32_t Write_Data_Section_22;
  uint32_t Write_Data_Section_23;
  uint32_t Write_Data_Section_24;
  uint32_t Write_Data_Section_25;
  uint32_t Write_Data_Section_26;
  uint32_t Write_Data_Section_27;
  uint32_t Write_Data_Section_28;
  uint32_t Write_Data_Section_29;
  uint32_t Write_Data_Section_30;
  uint32_t Write_Data_Section_31;
  uint32_t Write_Data_Section_32;
  uint32_t Write_Data_Section_33;
  uint32_t Write_Data_Section_34;
  uint32_t Write_Data_Section_35;
  uint32_t Write_Data_Section_36;
  uint32_t Write_Data_Section_37;
  uint32_t Write_Data_Section_38;
  uint32_t Write_Data_Section_39;
  uint32_t Write_Data_Section_40;
  uint32_t Write_Data_Section_41;
  uint32_t Write_Data_Section_42;
  uint32_t Write_Data_Section_43;
  uint32_t Write_Data_Section_44;
  uint32_t Write_Data_Section_45;
  uint32_t Write_Data_Section_46;
  uint32_t Write_Data_Section_47;
  uint32_t Write_Data_Section_48;
  uint32_t Write_Data_Section_49;
  uint32_t Write_Data_Section_50;
  uint32_t Write_Data_Section_51;
  uint32_t Write_Data_Section_52;
  uint32_t Write_Data_Section_53;
  uint32_t Write_Data_Section_54;
  uint32_t Write_Data_Section_55;
  uint32_t Write_Data_Section_56;
  uint32_t Write_Data_Section_57;
  uint32_t Write_Data_Section_58;
  uint32_t Write_Data_Section_59;
  uint32_t Write_Data_Section_60;
  uint32_t Write_Data_Section_61;
  uint32_t Write_Data_Section_62;
  uint32_t Write_Data_Section_63;
  uint32_t Write_Data_Section_64;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FID:11;
      uint64_t reservedSpace0:5;
      uint64_t CYC:7;
      uint64_t reservedSpace1:1;
      uint64_t CHA:1;
      uint64_t CHB:1;
      uint64_t CFG:1;
      uint64_t PPIT:1;
      uint64_t TXM:1;
      uint64_t MBI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WRHS1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC:11;
      uint64_t reservedSpace0:5;
      uint64_t PLC:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WRHS2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DP:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WRHS3;

  uint8_t res11[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LHSH:1;
      uint64_t LDSH:1;
      uint64_t STXRH:1;
      uint64_t reservedSpace0:13;
      uint64_t LHSS:1;
      uint64_t LDSS:1;
      uint64_t STXRS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IBCM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IBRH:7;
      uint64_t reservedSpace0:8;
      uint64_t IBSYH:1;
      uint64_t IBRS:7;
      uint64_t reservedSpace1:8;
      uint64_t IBSYS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IBCR;

  uint8_t res12[232];

  uint32_t Read_Data_Section_1;
  uint32_t Read_Data_Section_2;
  uint32_t Read_Data_Section_3;
  uint32_t Read_Data_Section_4;
  uint32_t Read_Data_Section_5;
  uint32_t Read_Data_Section_6;
  uint32_t Read_Data_Section_7;
  uint32_t Read_Data_Section_8;
  uint32_t Read_Data_Section_9;
  uint32_t Read_Data_Section_10;
  uint32_t Read_Data_Section_11;
  uint32_t Read_Data_Section_12;
  uint32_t Read_Data_Section_13;
  uint32_t Read_Data_Section_14;
  uint32_t Read_Data_Section_15;
  uint32_t Read_Data_Section_16;
  uint32_t Read_Data_Section_17;
  uint32_t Read_Data_Section_18;
  uint32_t Read_Data_Section_19;
  uint32_t Read_Data_Section_20;
  uint32_t Read_Data_Section_21;
  uint32_t Read_Data_Section_22;
  uint32_t Read_Data_Section_23;
  uint32_t Read_Data_Section_24;
  uint32_t Read_Data_Section_25;
  uint32_t Read_Data_Section_26;
  uint32_t Read_Data_Section_27;
  uint32_t Read_Data_Section_28;
  uint32_t Read_Data_Section_29;
  uint32_t Read_Data_Section_30;
  uint32_t Read_Data_Section_31;
  uint32_t Read_Data_Section_32;
  uint32_t Read_Data_Section_33;
  uint32_t Read_Data_Section_34;
  uint32_t Read_Data_Section_35;
  uint32_t Read_Data_Section_36;
  uint32_t Read_Data_Section_37;
  uint32_t Read_Data_Section_38;
  uint32_t Read_Data_Section_39;
  uint32_t Read_Data_Section_40;
  uint32_t Read_Data_Section_41;
  uint32_t Read_Data_Section_42;
  uint32_t Read_Data_Section_43;
  uint32_t Read_Data_Section_44;
  uint32_t Read_Data_Section_45;
  uint32_t Read_Data_Section_46;
  uint32_t Read_Data_Section_47;
  uint32_t Read_Data_Section_48;
  uint32_t Read_Data_Section_49;
  uint32_t Read_Data_Section_50;
  uint32_t Read_Data_Section_51;
  uint32_t Read_Data_Section_52;
  uint32_t Read_Data_Section_53;
  uint32_t Read_Data_Section_54;
  uint32_t Read_Data_Section_55;
  uint32_t Read_Data_Section_56;
  uint32_t Read_Data_Section_57;
  uint32_t Read_Data_Section_58;
  uint32_t Read_Data_Section_59;
  uint32_t Read_Data_Section_60;
  uint32_t Read_Data_Section_61;
  uint32_t Read_Data_Section_62;
  uint32_t Read_Data_Section_63;
  uint32_t Read_Data_Section_64;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FID:11;
      uint64_t reservedSpace0:5;
      uint64_t CYC:7;
      uint64_t reservedSpace1:1;
      uint64_t CHA:1;
      uint64_t CHB:1;
      uint64_t CFG:1;
      uint64_t PPIT:1;
      uint64_t TXM:1;
      uint64_t MBI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RDHS1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC:11;
      uint64_t reservedSpace0:5;
      uint64_t PLC:7;
      uint64_t reservedSpace1:1;
      uint64_t PLR:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RDHS2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DP:11;
      uint64_t reservedSpace0:5;
      uint64_t RCC:6;
      uint64_t reservedSpace1:2;
      uint64_t RCI:1;
      uint64_t SFI:1;
      uint64_t SYN:1;
      uint64_t NFI:1;
      uint64_t PPI:1;
      uint64_t RES:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RDHS3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VFRA:1;
      uint64_t VFRB:1;
      uint64_t SEOA:1;
      uint64_t SEOB:1;
      uint64_t CEOA:1;
      uint64_t CEOB:1;
      uint64_t SVOA:1;
      uint64_t SVOB:1;
      uint64_t TCIA:1;
      uint64_t TCIB:1;
      uint64_t ESA:1;
      uint64_t ESB:1;
      uint64_t MLST:1;
      uint64_t reservedSpace0:1;
      uint64_t FTA:1;
      uint64_t FTB:1;
      uint64_t CCS:6;
      uint64_t reservedSpace1:2;
      uint64_t RCIS:1;
      uint64_t SFIS:1;
      uint64_t SYNS:1;
      uint64_t MFIS:1;
      uint64_t PPIS:1;
      uint64_t RESS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MBS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RHSS:1;
      uint64_t RDSS:1;
      uint64_t reservedSpace0:14;
      uint64_t RHSH:1;
      uint64_t RDSH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OBCM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OBRS:7;
      uint64_t reservedSpace0:1;
      uint64_t VIEW:1;
      uint64_t REQ:1;
      uint64_t reservedSpace1:5;
      uint64_t OBSYS:1;
      uint64_t OBRH:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OBCR;

